geant4_validation/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SuperNEMO - Geant4 Validation</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="../css/styles.css">
                 <link rel="stylesheet" href="../css/org-pygments.css">
                 <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css">
</head>
<body onload="displayTOC()"><div id="toc"></div>
<div id="content">
<h1 class="title">SuperNEMO - Geant4 Validation</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Content</a></li>
<li><a href="#sec-3">3. Geometry setup</a>
<ul>
<li><a href="#sec-3-1">3.1. Manager configuration</a></li>
<li><a href="#sec-3-2">3.2. Geometry models</a></li>
<li><a href="#sec-3-3">3.3. Mapping categories</a></li>
<li><a href="#sec-3-4">3.4. Materials plugin</a></li>
<li><a href="#sec-3-5">3.5. Magnetic field plugin</a></li>
<li><a href="#sec-3-6">3.6. Visualization settings</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Simulation setup</a>
<ul>
<li><a href="#sec-4-1">4.1. Geant4 configuration</a></li>
<li><a href="#sec-4-2">4.2. Genbb configuration</a></li>
<li><a href="#sec-4-3">4.3. Vertex configuration</a></li>
<li><a href="#sec-4-4">4.4. Step hit processor configuration</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Pipeline general configuration</a>
<ul>
<li><a href="#sec-5-1">5.1. Module manager</a></li>
<li><a href="#sec-5-2">5.2. Service manager</a></li>
<li><a href="#sec-5-3">5.3. DLL loader</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Modules configuration</a>
<ul>
<li><a href="#sec-6-1">6.1. Simulation module</a></li>
<li><a href="#sec-6-2">6.2. Validation module</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Services</a>
<ul>
<li><a href="#sec-7-1">7.1. Preamble</a></li>
<li><a href="#sec-7-2">7.2. Context service</a></li>
<li><a href="#sec-7-3">7.3. Geometry service</a></li>
<li><a href="#sec-7-4">7.4. Histogram service</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Running SN@ilWare processing chain</a>
<ul>
<li><a href="#sec-8-1">8.1. Tangling configuration</a></li>
<li><a href="#sec-8-2">8.2. Source code compilation</a></li>
<li><a href="#sec-8-3">8.3. Use and execute <code>geant4_validation</code> module</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This repository holds a configuration to study Geant4 simulation and to plot
relevant physical quantities in order to check Geant4 reliability.
</p>

<p>
The current version is hosted at
<a href="https://github.com/xgarrido/snemo_simulation_modules/geant4_validation">https://github.com/xgarrido/snemo_simulation_modules/geant4_validation</a> under
<code>git</code> version control. You can clone this repository by doing
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/xgarrido/snemo_simulation_modules/geant4_validation geant4_validation
</pre>
</div>

<p>
This will create a directory <code>geant4_validation</code> in the working directory
containing all the source files needed to configure and to setup SN@ilWare
programs.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Content</h2>
<div class="outline-text-2" id="text-2">
<p>
The code is organised as follow :
</p>

<dl class="org-dl">
<dt> <code>README.org</code> </dt><dd>This file holds the pipeline configuration + the documentation
on how to use the <code>geant4_validation</code> module.
</dd>
<dt> <code>Makefile</code> </dt><dd>The <code>Makefile</code> allows to generate the pipeline configuration by
parsing and tangling this file <i>i.e.</i> <code>README.org</code> (see below).
</dd>
<dt> <code>source</code> </dt><dd>This directory holds the source code of the <code>geant4_validation</code>
module. It also has a <code>CMakeLists.txt</code> file in order to compile,
build and install all the software pieces through <code>cmake</code> rules.
</dd>
</dl>

<p>
The <code>README.org</code> file is organised using <a href="http://orgmode.org/worg/org-contrib/babel/index.html">org-babel</a> and its ability to execute
source code. It requires then a recent installation of emacs<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> which bundles
<code>org</code>. Without entering into too much details regarding <code>org-babel</code> abilities,
the basic idea is to give a "literate" way to navigate through the different
sections, each of them representing a part of the pipeline
configuration. Moreover, using <code>org</code> folding/unfolding capability, item can be
hide and the user can focus on relevant parts.
</p>

<p>
To export the different configuration files, you can run <code>org-babel-tangle</code>
which will tangle each code block into the given file<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> or use the associated
<code>Makefile</code>. The author recommends to use the <code>Makefile</code> since the tangling
process is asynchronous and thus, does not freeze your emacs (<code>org-babel-tangle</code>
"occupies" emacs during its execution).
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Geometry setup</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Manager configuration</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Setup label, description and version</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup label</span>
setup_label : <span class="org-variable-name">string</span> = <span class="org-string">"geant4_validation"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup description</span>
setup_description : <span class="org-variable-name">string</span> = <span class="org-string">"A minimal geometry setup to test Geant4"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup version</span>
setup_version : <span class="org-variable-name">string</span> = <span class="org-string">"1.0"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Logging priority</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Geometry factory</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
The geometry factory holds all the files needed for the geometry construction.
</p>
</div>
<ul class="org-ul"><li>Logging priority<br  /><div class="outline-text-5" id="text-3-1-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority of the embedded geometry model factory</span>
factory.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>Geometry files<br  /><div class="outline-text-5" id="text-3-1-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files describing the geometry models</span>
factory.geom_files : string[3] as <span class="org-variable-name">path</span> =                        <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/optical_module.geom"</span> <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/source.geom"</span>         <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/lab_world.geom"</span>
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> ID manager</h4>
<div class="outline-text-4" id="text-3-1-4">
</div><ul class="org-ul"><li>Logging priority<br  /><div class="outline-text-5" id="text-3-1-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag of the embedded ID manager</span>
id_mgr.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>Category list<br  /><div class="outline-text-5" id="text-3-1-4-2">
<p>
Categories are used to assign a unique id number (integer) to a geometrical
volume.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Source file of the geometry categories used by the ID manager</span>
id_mgr.categories_list : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/categories.lis"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Mapping configuration</h4>
<div class="outline-text-4" id="text-3-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Build the embedded default mapping dictionnary</span>
build_mapping : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max depth of the mapping</span>
mapping.max_depth : <span class="org-variable-name">integer</span> = 100
</pre>
</div>
</div>
</div>
