geant4_validation/README.org
*** Plugins configuration
#+BEGIN_SRC sh
  #@description Plugins factory preload from system registration (default=0)
  plugins.factory_no_preload : boolean = 0

  #@description Plugins initialization at load (default=0)
  plugins.force_initialization_at_load : boolean = 0

  #@description Configuration files for geometry manager's plugins
  plugins.configuration_files : string[2] as path =                   \
      "@GEANT4_VALIDATION_DIR@/config/geometry/materials_plugin.conf" \
      "@GEANT4_VALIDATION_DIR@/config/geometry/magnetic_field_plugin.conf"
#+END_SRC

** Geometry models
*** Optical module
:PROPERTIES:
:TANGLE: config/geometry/optical_module.geom
:END:
**** Preamble
#+BEGIN_SRC sh
  #@description List of geometry models
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** Wrapping model
***** z-position (front) wrapping
#+BEGIN_SRC sh
  [name="zpos_wrapping.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the wrapping in front of the scintillator block

  #@description The name of the 3D shape
  shape_type : string =  "box"

  #@description The X dimension
  x : real as length  = 100.0 mm

  #@description The Y dimension
  y : real as length  = 100.0 mm

  #@description The Z dimension
  z : real as length  = 12 um

  #@description The name of the material
  material.ref : string  = "mylar"
#+END_SRC
***** x-sides wrapping
****** Model
#+BEGIN_SRC sh
  [name="x_sides_wrapping.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the wrapping on X sides of the scintillator block

  #@description The name of the 3D shape
  shape_type : string = "box"

  #@description The X dimension
  x : real as length = 40.0 mm

  #@description The Y dimension
  y : real as length = 100.0 mm

  #@description The Z dimension
  z : real as length = 12 um

  #@description The name of the material
  material.ref      : string  = "mylar"
#+END_SRC
****** Positionning
#+BEGIN_SRC sh
  [name="xpos_wrapping.model" type="geomtools::rotated_boxed_model"]

  #@config The configuration parameters for the rotated wrapping film

  #@description Rotation geometry model
  rotated.model : string = "x_sides_wrapping.model"

  #@description Rotated geometry model label
  rotated.label : string = "side_wrapping"

  #@description Rotation axis
  rotated.axis  : string = "y"

  #@description Rotation special angle
  rotated.special_angle : string  = "90"

  #@description The name of the material
  material.ref      : string  = "lab_medium"
#+END_SRC
#+BEGIN_SRC sh
  [name="xneg_wrapping.model" type="geomtools::rotated_boxed_model"]

  #@config The configuration parameters for the rotated wrapping film

  #@description Rotation axis
  rotated.axis  : string = "y"

  #@description Rotation special angle
  rotated.special_angle : string  = "270"

  #@description Rotation geometry model
  rotated.model : string = "x_sides_wrapping.model"

  #@description Rotated geometry model label
  rotated.label : string = "side_wrapping"

  #@description The name of the material
  material.ref      : string  = "lab_medium"
#+END_SRC

***** y-sides wrapping
****** Model
#+BEGIN_SRC sh
  [name="y_sides_wrapping.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the wrapping on Y sides of the scintillator block

  #@description The name of the 3D shape
  shape_type : string = "box"

  #@description The X dimension
  x : real as length = 100.0 mm

  #@description The Y dimension
  y : real as length = 40.0 mm

  #@description The Z dimension
  z : real as length = 12 um

  #@description The name of the material
  material.ref : string = "mylar"
#+END_SRC
