geant4_validation/README.html

<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> Plugins configuration</h4>
<div class="outline-text-4" id="text-3-1-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Plugins factory preload from system registration (default=0)</span>
plugins.factory_no_preload : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Plugins initialization at load (default=0)</span>
plugins.force_initialization_at_load : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration files for geometry manager's plugins</span>
plugins.configuration_files : string[2] as <span class="org-variable-name">path</span> =                   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/materials_plugin.conf"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/magnetic_field_plugin.conf"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Geometry models</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Optical module</h4>
<div class="outline-text-4" id="text-3-2-1">
</div>
<ul class="org-ul"><li>Preamble<br  /><div class="outline-text-5" id="text-3-2-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of geometry models</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>Wrapping model<br  /><ul class="org-ul"><li>z-position (front) wrapping<br  /><div class="outline-text-6" id="text-3-2-1-2-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"zpos_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the wrapping in front of the scintillator block</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type : <span class="org-variable-name">string</span> =  <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x : real as <span class="org-variable-name">length</span>  = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y : real as <span class="org-variable-name">length</span>  = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension</span>
z : real as <span class="org-variable-name">length</span>  = 12 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span>  = <span class="org-string">"mylar"</span>
</pre>
</div>
</div>
</li>

<li>x-sides wrapping<br  /><ul class="org-ul"><li>Model<br  /><div class="outline-text-7" id="text-3-2-1-2-2-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"x_sides_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the wrapping on X sides of the scintillator block</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type : <span class="org-variable-name">string</span> = <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x : real as <span class="org-variable-name">length</span> = 40.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension</span>
z : real as <span class="org-variable-name">length</span> = 12 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"mylar"</span>
</pre>
</div>
</div>
</li>

<li>Positionning<br  /><div class="outline-text-7" id="text-3-2-1-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"xpos_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::rotated_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the rotated wrapping film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation geometry model</span>
rotated.model : <span class="org-variable-name">string</span> = <span class="org-string">"x_sides_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotated geometry model label</span>
rotated.label : <span class="org-variable-name">string</span> = <span class="org-string">"side_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation axis</span>
rotated.axis  : <span class="org-variable-name">string</span> = <span class="org-string">"y"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation special angle</span>
rotated.special_angle : <span class="org-variable-name">string</span>  = <span class="org-string">"90"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"xneg_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::rotated_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the rotated wrapping film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation axis</span>
rotated.axis  : <span class="org-variable-name">string</span> = <span class="org-string">"y"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation special angle</span>
rotated.special_angle : <span class="org-variable-name">string</span>  = <span class="org-string">"270"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation geometry model</span>
rotated.model : <span class="org-variable-name">string</span> = <span class="org-string">"x_sides_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotated geometry model label</span>
rotated.label : <span class="org-variable-name">string</span> = <span class="org-string">"side_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
</div>
</li></ul>
</li>
<li>y-sides wrapping<br  /><ul class="org-ul"><li>Model<br  /><div class="outline-text-7" id="text-3-2-1-2-3-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"y_sides_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the wrapping on Y sides of the scintillator block</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type : <span class="org-variable-name">string</span> = <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y : real as <span class="org-variable-name">length</span> = 40.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension</span>
z : real as <span class="org-variable-name">length</span> = 12 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span> = <span class="org-string">"mylar"</span>
</pre>
</div>
</div>
</li>

<li>Positionning<br  /><div class="outline-text-7" id="text-3-2-1-2-3-2">
