geant4_validation/README.org
****** Positionning
#+BEGIN_SRC sh
  [name="ypos_wrapping.model" type="geomtools::rotated_boxed_model"]

  #@config The configuration parameters for the rotated wrapping film

  #@description Rotation axis
  rotated.axis  : string = "x"

  #@description Rotation special angle
  rotated.special_angle : string  = "90"

  #@description Rotation geometry model
  rotated.model : string = "y_sides_wrapping.model"

  #@description Rotated geometry model label
  rotated.label : string = "side_wrapping"

  #@description The name of the material
  material.ref      : string  = "lab_medium"
#+END_SRC
#+BEGIN_SRC sh
  [name="yneg_wrapping.model" type="geomtools::rotated_boxed_model"]

  #@config The configuration parameters for the rotated wrapping film

  #@description Rotation axis
  rotated.axis  : string = "x"

  #@description Rotation special angle
  rotated.special_angle : string  = "270"

  #@description Rotation geometry model
  rotated.model : string = "y_sides_wrapping.model"

  #@description Rotated geometry model label
  rotated.label : string = "side_wrapping"

  #@description The name of the material
  material.ref      : string  = "lab_medium"
#+END_SRC
**** Scintillator model
***** Block model
We first design the shape and the dimensions of the block
#+BEGIN_SRC sh
  [name="scintillator_block.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the scintillator block

  #@description The name of the 3D shape
  shape_type : string =  "box"

  #@description The X dimension
  x : real as length = 100.0 mm

  #@description The Y dimension
  y : real as length = 100.0 mm

  #@description The Z dimension
  z : real as length = 40.0 mm
#+END_SRC

Then we define a material
#+BEGIN_SRC sh
  #@description The name of the material
  # material.ref      : string = "polystyrene"
  material.ref      : string = "std::NaI"
#+END_SRC

Finally, we attach to it a sensitive category to ease the interface between
=mctools= and Geant4 digitization[fn:1]
#+BEGIN_SRC sh
  #@description The 'sensitive' category attached to this detector volume
  sensitive.category : string  = "scin_SD"
#+END_SRC
