geant4_validation/README.html
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"ypos_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::rotated_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the rotated wrapping film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation axis</span>
rotated.axis  : <span class="org-variable-name">string</span> = <span class="org-string">"x"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation special angle</span>
rotated.special_angle : <span class="org-variable-name">string</span>  = <span class="org-string">"90"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation geometry model</span>
rotated.model : <span class="org-variable-name">string</span> = <span class="org-string">"y_sides_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotated geometry model label</span>
rotated.label : <span class="org-variable-name">string</span> = <span class="org-string">"side_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"yneg_wrapping.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::rotated_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the rotated wrapping film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation axis</span>
rotated.axis  : <span class="org-variable-name">string</span> = <span class="org-string">"x"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation special angle</span>
rotated.special_angle : <span class="org-variable-name">string</span>  = <span class="org-string">"270"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotation geometry model</span>
rotated.model : <span class="org-variable-name">string</span> = <span class="org-string">"y_sides_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Rotated geometry model label</span>
rotated.label : <span class="org-variable-name">string</span> = <span class="org-string">"side_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
</div>
</li></ul>
</li></ul>
</li>

<li>Scintillator model<br  /><ul class="org-ul"><li>Block model<br  /><div class="outline-text-6" id="text-3-2-1-3-1">
<p>
We first design the shape and the dimensions of the block
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"scintillator_block.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the scintillator block</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type : <span class="org-variable-name">string</span> =  <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension</span>
z : real as <span class="org-variable-name">length</span> = 40.0 mm
</pre>
</div>

<p>
Then we define a material
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">material.ref      : string = "polystyrene"</span>
material.ref      : <span class="org-variable-name">string</span> = <span class="org-string">"std::NaI"</span>
</pre>
</div>

<p>
Finally, we attach to it a sensitive category to ease the interface between
<code>mctools</code> and Geant4 digitization<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The 'sensitive' category attached to this detector volume</span>
sensitive.category : <span class="org-variable-name">string</span>  = <span class="org-string">"scin_SD"</span>
</pre>
</div>
</div>
</li>
