geant4_validation/README.org
***** Wrapped block model
The wrapped model consists of wrapping with mylar the previous "nude" block. We
then use a =surrounded_bowed_model= to place mylar on each scintillator faces.
#+BEGIN_SRC sh
  [name="wrapped_scintillator_block.model" type="geomtools::surrounded_boxed_model"]

  #@config The configuration parameters for the wrapped scintillatorblock

  #@description The name of the surrounded geometry model
  surrounded.model         : string = "scintillator_block.model"

  #@description The label associated to the surrounded geometry model
  surrounded.label         : string = "scintillator_block"

  #@description The name of the (z>0) side surrounding geometry model
  surrounded.top_model     : string = "zpos_wrapping.model"

  #@description The name of a  (x>0) side surrounding geometry model
  surrounded.front_model   : string = "xpos_wrapping.model"

  #@description The name of a  (x<0) side surrounding geometry model
  surrounded.back_model    : string = "xneg_wrapping.model"

  #@description The name of a  (y>0) side surrounding geometry model
  surrounded.right_model   : string = "ypos_wrapping.model"

  #@description The name of a  (y<0) side surrounding geometry model
  surrounded.left_model    : string = "yneg_wrapping.model"

  #@description The label of the (z>0) side surrounding geometry model
  surrounded.top_label     : string = "top_wrapping"

  #@description The label of a  (x>0) side surrounding geometry model
  surrounded.front_label   : string = "front_wrapping"

  #@description The label of a  (x<0) side surrounding geometry model
  surrounded.back_label    : string = "back_wrapping"

  #@description The label of a  (y>0) side surrounding geometry model
  surrounded.right_label   : string = "right_wrapping"

  #@description The label of a  (y<0) side surrounding geometry model
  surrounded.left_label    : string = "left_wrapping"

  #@description The name of the material
  material.ref      : string  = "lab_medium"
#+END_SRC

Finally, we attach mapping id to the mother volume as well as its daughter
/i.e./ mylar elements.
#+BEGIN_SRC sh
  #@description The mapping directive for the "scintillator_block" daughter volume
  mapping.daughter_id.scintillator_block : string  = "[scin_block.gc]"

  #@description The mapping directive for the "left_wrapping" daughter volume
  mapping.daughter_id.front_wrapping     : string  = "[scin_block_wrapping.gc:side=0]"

  #@description The mapping directive for the "right_wrapping" daughter volume
  mapping.daughter_id.back_wrapping      : string  = "[scin_block_wrapping.gc:side=1]"

  #@description The mapping directive for the "left_wrapping" daughter volume
  mapping.daughter_id.left_wrapping      : string  = "[scin_block_wrapping.gc:side=2]"

  #@description The mapping directive for the "right_wrapping" daughter volume
  mapping.daughter_id.right_wrapping     : string  = "[scin_block_wrapping.gc:side=3]"

  #@description The mapping directive for the "top_wrapping" daughter volume
  mapping.daughter_id.top_wrapping       : string  = "[scin_block_wrapping.gc:side=5]"
#+END_SRC
**** Light guide model
***** Basic light guide
#+BEGIN_SRC sh
  [name="light_guide.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the light guide

  #@description The default implicit length unit
  length_unit  : string = "mm"

  #@description The name of the 3D shape
  shape_type   : string = "polyhedra"

  #@description The polyhedra build mode
  build_mode   : string = "points"

  #@description The polyhedra number of sides
  sides        : integer = 4

  #@description The list of Z coordinates for the shape
  list_of_z    : real [3] =  -40.     +30.     +40.

  #@description The list of inner radius coordinates for the shape
  list_of_rmin : real [3] =    0.      0.       0.

  #@description The list of outer radius coordinates for the shape
  list_of_rmax : real [3] =    20.    50.     50.

  #@description The name of the material
  material.ref : string  = "plexiglass"
#+END_SRC
***** Rotated light guide
#+BEGIN_SRC sh
  [name="rotated_light_guide.model" type="geomtools::rotated_boxed_model"]

  #@config The configuration parameters for the rotated light guide

  #@description The rotation axis
  rotated.axis  : string = "z"

  #@description The rotation angle
  rotated.angle : real as angle = 45.0 degree

  #@description The X dimension
  x             : real as length = 100.0 mm

  #@description The Y dimension
  y             : real as length = 100.0 mm

  #@description The name of the model to be rotated
  rotated.model : string = "light_guide.model"

  #@description The label associated to the rotated daughter model
  rotated.label : string = "light_guide"

  #@description The name of the material around the light guide to be rotated
  material.ref  : string  = "lab_medium"
#+END_SRC
