geant4_validation/README.html

<li>Wrapped block model<br  /><div class="outline-text-6" id="text-3-2-1-3-2">
<p>
The wrapped model consists of wrapping with mylar the previous "nude" block. We
then use a <code>surrounded_bowed_model</code> to place mylar on each scintillator faces.
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"wrapped_scintillator_block.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::surrounded_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the wrapped scintillatorblock</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the surrounded geometry model</span>
surrounded.model         : <span class="org-variable-name">string</span> = <span class="org-string">"scintillator_block.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label associated to the surrounded geometry model</span>
surrounded.label         : <span class="org-variable-name">string</span> = <span class="org-string">"scintillator_block"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the (z&gt;0) side surrounding geometry model</span>
surrounded.top_model     : <span class="org-variable-name">string</span> = <span class="org-string">"zpos_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of a  (x&gt;0) side surrounding geometry model</span>
surrounded.front_model   : <span class="org-variable-name">string</span> = <span class="org-string">"xpos_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of a  (x&lt;0) side surrounding geometry model</span>
surrounded.back_model    : <span class="org-variable-name">string</span> = <span class="org-string">"xneg_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of a  (y&gt;0) side surrounding geometry model</span>
surrounded.right_model   : <span class="org-variable-name">string</span> = <span class="org-string">"ypos_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of a  (y&lt;0) side surrounding geometry model</span>
surrounded.left_model    : <span class="org-variable-name">string</span> = <span class="org-string">"yneg_wrapping.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the (z&gt;0) side surrounding geometry model</span>
surrounded.top_label     : <span class="org-variable-name">string</span> = <span class="org-string">"top_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of a  (x&gt;0) side surrounding geometry model</span>
surrounded.front_label   : <span class="org-variable-name">string</span> = <span class="org-string">"front_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of a  (x&lt;0) side surrounding geometry model</span>
surrounded.back_label    : <span class="org-variable-name">string</span> = <span class="org-string">"back_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of a  (y&gt;0) side surrounding geometry model</span>
surrounded.right_label   : <span class="org-variable-name">string</span> = <span class="org-string">"right_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of a  (y&lt;0) side surrounding geometry model</span>
surrounded.left_label    : <span class="org-variable-name">string</span> = <span class="org-string">"left_wrapping"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>

<p>
Finally, we attach mapping id to the mother volume as well as its daughter
<i>i.e.</i> mylar elements.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "scintillator_block" daughter volume</span>
mapping.daughter_id.scintillator_block : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block.gc]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "left_wrapping" daughter volume</span>
mapping.daughter_id.front_wrapping     : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block_wrapping.gc:side=0]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "right_wrapping" daughter volume</span>
mapping.daughter_id.back_wrapping      : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block_wrapping.gc:side=1]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "left_wrapping" daughter volume</span>
mapping.daughter_id.left_wrapping      : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block_wrapping.gc:side=2]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "right_wrapping" daughter volume</span>
mapping.daughter_id.right_wrapping     : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block_wrapping.gc:side=3]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "top_wrapping" daughter volume</span>
mapping.daughter_id.top_wrapping       : <span class="org-variable-name">string</span>  = <span class="org-string">"[scin_block_wrapping.gc:side=5]"</span>
</pre>
</div>
</div>
</li></ul>
</li>

<li>Light guide model<br  /><ul class="org-ul"><li>Basic light guide<br  /><div class="outline-text-6" id="text-3-2-1-4-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"light_guide.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the light guide</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The default implicit length unit</span>
length_unit  : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type   : <span class="org-variable-name">string</span> = <span class="org-string">"polyhedra"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The polyhedra build mode</span>
build_mode   : <span class="org-variable-name">string</span> = <span class="org-string">"points"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The polyhedra number of sides</span>
sides        : <span class="org-variable-name">integer</span> = 4

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of Z coordinates for the shape</span>
list_of_z    : real [3] =  -40.     +30.     +40.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of inner radius coordinates for the shape</span>
list_of_rmin : real [3] =    0.      0.       0.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of outer radius coordinates for the shape</span>
list_of_rmax : real [3] =    20.    50.     50.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span>  = <span class="org-string">"plexiglass"</span>
</pre>
</div>
</div>
</li>

<li>Rotated light guide<br  /><div class="outline-text-6" id="text-3-2-1-4-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">########################################################################</span>
[<span class="org-variable-name">name</span>=<span class="org-string">"rotated_light_guide.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::rotated_boxed_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the rotated light guide</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The rotation axis</span>
rotated.axis  : <span class="org-variable-name">string</span> = <span class="org-string">"z"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The rotation angle</span>
rotated.angle : real as <span class="org-variable-name">angle</span> = 45.0 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x             : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y             : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the model to be rotated</span>
rotated.model : <span class="org-variable-name">string</span> = <span class="org-string">"light_guide.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label associated to the rotated daughter model</span>
rotated.label : <span class="org-variable-name">string</span> = <span class="org-string">"light_guide"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material around the light guide to be rotated</span>
material.ref  : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
</div>
</li></ul>
</li>

<li>PMT model<br  /><div class="outline-text-5" id="text-3-2-1-5">
