geant4_validation/README.org
**** PMT model
#+BEGIN_SRC sh
  [name="pmt.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the photomultiplier tube

  #@description The default implicit length unit
  length_unit  : string   = "mm"

  #@description The name of the 3D shape
  shape_type   : string   = "polycone"

  #@description The polycone build mode
  build_mode   : string   = "points"

  #@description The list of Z coordinates for the shape
  list_of_z    : real [6] =  -50.0   -49.0  -48.99  +48.99  +49.0 +50.0

  #@description The list of inner radius coordinates for the shape
  list_of_rmin : real [6] =    0.      0.    19.     19.      0.    0.

  #@description The list of outer radius coordinates for the shape
  list_of_rmax : real [6] =    20.    20.    20.     20.     20.   20.

  #@description The name of the material
  material.ref : string  = "glass"
#+END_SRC
**** Optical module
Given the previous model, we stack them to get a full optical module from PMT \to
light guide \to scintillator block \to the last layer of mylar
#+BEGIN_SRC sh
  [name="optical_module.model" type="geomtools::stacked_model"]

  #@config The configuration parameters for the optical module

  #@description The stacking axis
  stacked.axis            : string = "z"

  #@description The number of stacked volumes
  stacked.number_of_items : integer = 3

  #@description The model of the stacked volume #2
  stacked.model_2   : string  = "wrapped_scintillator_block.model"

  #@description The label of the stacked volume #2
  stacked.label_2   : string  = "scintillator_block"

  #@description The model of the stacked volume #1
  stacked.model_1   : string   = "rotated_light_guide.model"

  #@description The label of the stacked volume #1
  stacked.label_1   : string  = "light_guide"

  #@description The model of the stacked volume #0
  stacked.model_0   : string   = "pmt.model"

  #@description The label of the stacked volume #0
  stacked.label_0   : string  = "pmt"

  #@description The name of the material
  material.ref      : string    = "lab_medium"

  #@description The mapping directive for the "light_guide" daughter volume
  mapping.daughter_id.light_guide : string  = "[light_guide.gc]"
#+END_SRC
*** Source
:PROPERTIES:
:TANGLE: config/geometry/source.geom
:END:
**** Preamble
#+BEGIN_SRC sh
  #@description List of geometry models
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** Film model
#+BEGIN_SRC sh
  [name="source_film.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the source film

  #@description The name of the 3D shape of the source film
  shape_type  : string = "cylinder"

  #@description The R dimension (radius) of the cylinder source film
  r : real as length = 9.5 mm

  #@description The Z dimension (thickness) of the cylinder source film
  z : real as length = 5 um

  #@description The name of the material of the source film
  material.ref : string = "mylar"
#+END_SRC
**** Source support model
#+BEGIN_SRC sh
  [name="source_support.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the source support

  #@description The name of the 3D shape of the source support ring
  shape_type  : string = "tube"

  #@description The inner R dimension (inner radius) of the source support ring
  inner_r     : real as length = 10.0 mm

  #@description The outer R dimension (inner radius) of the source support ring
  outer_r     : real as length = 12.0 mm

  #@description The Z dimension (thickness) of the source support ring
  z           : real as length = 5.0 mm

  #@description The name of the material of the source support ring
  material.ref : string = "aluminium"
#+END_SRC

