geant4_validation/README.html
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"pmt.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the photomultiplier tube</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The default implicit length unit</span>
length_unit  : <span class="org-variable-name">string</span>   = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type   : <span class="org-variable-name">string</span>   = <span class="org-string">"polycone"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The polycone build mode</span>
build_mode   : <span class="org-variable-name">string</span>   = <span class="org-string">"points"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of Z coordinates for the shape</span>
list_of_z    : real [6] =  -50.0   -49.0  -48.99  +48.99  +49.0 +50.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of inner radius coordinates for the shape</span>
list_of_rmin : real [6] =    0.      0.    19.     19.      0.    0.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of outer radius coordinates for the shape</span>
list_of_rmax : real [6] =    20.    20.    20.     20.     20.   20.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span>  = <span class="org-string">"glass"</span>
</pre>
</div>
</div>
</li>

<li>Optical module<br  /><div class="outline-text-5" id="text-3-2-1-6">
<p>
Given the previous model, we stack them to get a full optical module from PMT &rarr;
light guide &rarr; scintillator block &rarr; the last layer of mylar
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"optical_module.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::stacked_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the optical module</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The stacking axis</span>
stacked.axis            : <span class="org-variable-name">string</span> = <span class="org-string">"z"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of stacked volumes</span>
stacked.number_of_items : <span class="org-variable-name">integer</span> = 3

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the stacked volume #2</span>
stacked.model_2   : <span class="org-variable-name">string</span>  = <span class="org-string">"wrapped_scintillator_block.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the stacked volume #2</span>
stacked.label_2   : <span class="org-variable-name">string</span>  = <span class="org-string">"scintillator_block"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the stacked volume #1</span>
stacked.model_1   : <span class="org-variable-name">string</span>   = <span class="org-string">"rotated_light_guide.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the stacked volume #1</span>
stacked.label_1   : <span class="org-variable-name">string</span>  = <span class="org-string">"light_guide"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the stacked volume #0</span>
stacked.model_0   : <span class="org-variable-name">string</span>   = <span class="org-string">"pmt.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the stacked volume #0</span>
stacked.label_0   : <span class="org-variable-name">string</span>  = <span class="org-string">"pmt"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>    = <span class="org-string">"lab_medium"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directive for the "light_guide" daughter volume</span>
mapping.daughter_id.light_guide : <span class="org-variable-name">string</span>  = <span class="org-string">"[light_guide.gc]"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Source</h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<ul class="org-ul"><li>Preamble<br  /><div class="outline-text-5" id="text-3-2-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of geometry models</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>Film model<br  /><div class="outline-text-5" id="text-3-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"source_film.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the source film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape of the source film</span>
shape_type  : <span class="org-variable-name">string</span> = <span class="org-string">"cylinder"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The R dimension (radius) of the cylinder source film</span>
<span class="org-builtin">r</span> : real as <span class="org-variable-name">length</span> = 9.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension (thickness) of the cylinder source film</span>
z : real as <span class="org-variable-name">length</span> = 5 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material of the source film</span>
material.ref : <span class="org-variable-name">string</span> = <span class="org-string">"mylar"</span>
</pre>
</div>
</div>
</li>

<li>Source support model<br  /><div class="outline-text-5" id="text-3-2-2-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"source_support.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the source support</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape of the source support ring</span>
shape_type  : <span class="org-variable-name">string</span> = <span class="org-string">"tube"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The inner R dimension (inner radius) of the source support ring</span>
inner_r     : real as <span class="org-variable-name">length</span> = 10.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The outer R dimension (inner radius) of the source support ring</span>
outer_r     : real as <span class="org-variable-name">length</span> = 12.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension (thickness) of the source support ring</span>
z           : real as <span class="org-variable-name">length</span> = 5.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material of the source support ring</span>
material.ref : <span class="org-variable-name">string</span> = <span class="org-string">"aluminium"</span>
</pre>
</div>
</div>
</li>
<li>Source model<br  /><div class="outline-text-5" id="text-3-2-2-4">
<p>
