geant4_validation/README.org
**** Source model
The source model will used the two previous models by placing them "internally"
to a larger cylinder. We first declare the holding volume
#+BEGIN_SRC sh
  [name="source.model" type="geomtools::simple_shaped_model"]

  #@description The name of the 3D shape of the source cylindric envelope
  shape_type  : string = "cylinder"

  #@description The R dimension (radius) of the source cylindric envelope
  r : real as length = 12.0 mm

  #@description The Z dimension (thickness) of the source cylindric envelope
  z : real as length = 5.0 mm

  #@description The name of the material
  material.ref : string  = "lab_medium"
#+END_SRC
and then place inside, the "support" and "film" models
#+BEGIN_SRC sh
  #@description The list of daughter volumes by label
  internal_item.labels : string[2] = "support" "film"

  #@description The model of the "support" daughter volume
  internal_item.model.support : string  = "source_support.model"

  #@description The placement of the "support" daughter volume
  internal_item.placement.support : string  = "0 0 0 (mm)"

  #@description The model of the "film" daughter volume
  internal_item.model.film : string  = "source_film.model"

  #@description The placement of the "film" daughter volume
  internal_item.placement.film : string  = "0 0 0 (mm)"
#+END_SRC

We finally define mapping ids
#+BEGIN_SRC sh
  #@description The mapping directives for the "film" daughter volume
  mapping.daughter_id.film : string  = "[source_film.gc]"

  #@description The mapping directives for the "support" daughter volume
  mapping.daughter_id.support : string  = "[source_support.gc]"
#+END_SRC
*** Laboratory & world volume
:PROPERTIES:
:TANGLE: config/geometry/lab_world.geom
:END:
**** Preamble
#+BEGIN_SRC sh
  #@description List of geometry models
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** Absorber
#+BEGIN_SRC sh
  [name="thin_absorber.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the thin_absorber front of the detector

  #@description The name of the 3D shape
  shape_type :   string =  "box"

  #@description The X dimension
  x   : real as length = 100.0 mm

  #@description The Y dimension
  y   : real as length = 100.0 mm

  #@description The Z dimension
  z   : real as length = 50 um

  #@description The name of the material
  material.ref      : string  = "copper"
#+END_SRC
**** Black box
#+BEGIN_SRC sh
  [name="black_box.model" type="geomtools::simple_shaped_model"]

  #@config The configuration parameters for the light guide

  #@description The default implicit length unit
  length_unit : string = "mm"

  #@description The name of the 3D shape
  shape_type : string = "polyhedra"

  #@description The polyhedra build mode
  build_mode : string = "points"

  #@description The polyhedra number of sides
  sides        : integer = 4

  #@description The list of Z coordinates for the shape
  list_of_z    : real [2] =   -125.     +125.

  #@description The list of inner radius coordinates for the shape
  list_of_rmin : real [2] =    51.      51.

  #@description The list of outer radius coordinates for the shape
  list_of_rmax : real [2] =    53.      53.

  #@description The name of the material
  material.ref : string  = "inox"
#+END_SRC
