geant4_validation/README.html
The source model will used the two previous models by placing them "internally"
to a larger cylinder. We first declare the holding volume
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"source.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape of the source cylindric envelope</span>
shape_type  : <span class="org-variable-name">string</span> = <span class="org-string">"cylinder"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The R dimension (radius) of the source cylindric envelope</span>
<span class="org-builtin">r</span> : real as <span class="org-variable-name">length</span> = 12.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension (thickness) of the source cylindric envelope</span>
z : real as <span class="org-variable-name">length</span> = 5.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span>  = <span class="org-string">"lab_medium"</span>
</pre>
</div>
<p>
and then place inside, the "support" and "film" models
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of daughter volumes by label</span>
internal_item.labels : <span class="org-variable-name">string</span>[2] = <span class="org-string">"support"</span> <span class="org-string">"film"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "support" daughter volume</span>
internal_item.model.support : <span class="org-variable-name">string</span>  = <span class="org-string">"source_support.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "support" daughter volume</span>
internal_item.placement.support : <span class="org-variable-name">string</span>  = <span class="org-string">"0 0 0 (mm)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "film" daughter volume</span>
internal_item.model.film : <span class="org-variable-name">string</span>  = <span class="org-string">"source_film.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "film" daughter volume</span>
internal_item.placement.film : <span class="org-variable-name">string</span>  = <span class="org-string">"0 0 0 (mm)"</span>
</pre>
</div>

<p>
We finally define mapping ids
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directives for the "film" daughter volume</span>
mapping.daughter_id.film : <span class="org-variable-name">string</span>  = <span class="org-string">"[source_film.gc]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directives for the "support" daughter volume</span>
mapping.daughter_id.support : <span class="org-variable-name">string</span>  = <span class="org-string">"[source_support.gc]"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Laboratory &amp; world volume</h4>
<div class="outline-text-4" id="text-3-2-3">
</div>
<ul class="org-ul"><li>Preamble<br  /><div class="outline-text-5" id="text-3-2-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of geometry models</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>Absorber<br  /><div class="outline-text-5" id="text-3-2-3-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"thin_absorber.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the thin_absorber front of the detector</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type :   <span class="org-variable-name">string</span> =  <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension</span>
x   : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension</span>
y   : real as <span class="org-variable-name">length</span> = 100.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension</span>
z   : real as <span class="org-variable-name">length</span> = 50 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref      : <span class="org-variable-name">string</span>  = <span class="org-string">"copper"</span>
</pre>
</div>
</div>
</li>

<li>Black box<br  /><div class="outline-text-5" id="text-3-2-3-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"black_box.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the light guide</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The default implicit length unit</span>
length_unit : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape</span>
shape_type : <span class="org-variable-name">string</span> = <span class="org-string">"polyhedra"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The polyhedra build mode</span>
build_mode : <span class="org-variable-name">string</span> = <span class="org-string">"points"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The polyhedra number of sides</span>
sides        : <span class="org-variable-name">integer</span> = 4

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of Z coordinates for the shape</span>
list_of_z    : real [2] =   -125.     +125.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of inner radius coordinates for the shape</span>
list_of_rmin : real [2] =    51.      51.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of outer radius coordinates for the shape</span>
list_of_rmax : real [2] =    53.      53.

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material</span>
material.ref : <span class="org-variable-name">string</span>  = <span class="org-string">"inox"</span>
</pre>
</div>
</div>
</li>

<li>Lab. model<br  /><div class="outline-text-5" id="text-3-2-3-4">
