geant4_validation/README.html
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"lab.model"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_shaped_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The configuration parameters for the laboratory experimental area</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the 3D shape of the lab area</span>
shape_type  : <span class="org-variable-name">string</span> = <span class="org-string">"box"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X dimension of the box</span>
x           : real as <span class="org-variable-name">length</span> = 900.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y dimension of the box</span>
y           : real as <span class="org-variable-name">length</span> = 450.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Z dimension of the box</span>
z           : real as <span class="org-variable-name">length</span> = 450.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material that fills the lab atmosphere</span>
material.ref : <span class="org-variable-name">string</span> = <span class="org-string">"lab_medium"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of daughter volumes by labels</span>
internal_item.labels : <span class="org-variable-name">string</span>[4] = <span class="org-string">"source"</span> <span class="org-string">"detector"</span> <span class="org-string">"box"</span> <span class="org-string">"absorber0"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "source" daughter volume</span>
internal_item.model.source        : <span class="org-variable-name">string</span>  = <span class="org-string">"source.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "source" daughter volume</span>
internal_item.placement.source    : <span class="org-variable-name">string</span>  = <span class="org-string">"20 0 0 (cm) / y +90 (degree)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "detector" daughter volume</span>
internal_item.model.detector      : <span class="org-variable-name">string</span>  = <span class="org-string">"optical_module.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "detector" daughter volume</span>
internal_item.placement.detector  : <span class="org-variable-name">string</span>  = <span class="org-string">"-20 0 0 (cm) / y +90 (degree) "</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "box" daughter volume</span>
internal_item.model.box           : <span class="org-variable-name">string</span>  = <span class="org-string">"black_box.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "box" daughter volume</span>
internal_item.placement.box       : <span class="org-variable-name">string</span>  = <span class="org-string">"-24 0 0 (cm) @  0 90 45 (degree) "</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The model of the "absorber0" daughter volume</span>
internal_item.model.absorber0     : <span class="org-variable-name">string</span>  = <span class="org-string">"thin_absorber.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The placement of the "absorber0" daughter volume</span>
internal_item.placement.absorber0 : <span class="org-variable-name">string</span>  = <span class="org-string">"0 0 0 (cm) @  0 90 0 (degree) "</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directives for the "source" daughter volume</span>
mapping.daughter_id.source   : <span class="org-variable-name">string</span>  = <span class="org-string">"[source.gc:position=0]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directives for the "detector" daughter volume</span>
mapping.daughter_id.detector : <span class="org-variable-name">string</span>  = <span class="org-string">"[optical_module.gc:detector=0]"</span>
</pre>
</div>
</div>
</li>

<li>World volume<br  /><div class="outline-text-5" id="text-3-2-3-5">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"world"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::simple_world_model"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config configuration parameters for the world logical volume</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The world volume X dimension (box)</span>
world.x         : real as <span class="org-variable-name">length</span>  = 1000.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The world volume Y dimension (box)</span>
world.y         : real as <span class="org-variable-name">length</span> = 500.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The world volume Z dimension (box)</span>
world.z         : real as <span class="org-variable-name">length</span> = 500.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the model that represents the experimental setup daughter volume</span>
setup.model     : <span class="org-variable-name">string</span> = <span class="org-string">"lab.model"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The setup placement phi angle</span>
setup.phi       : real as <span class="org-variable-name">angle</span> = 0.0 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The setup placement theta angle</span>
setup.theta     : real as <span class="org-variable-name">angle</span> = 0.0 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The setup placement X coordinate</span>
setup.x         : real as <span class="org-variable-name">length</span> = 0.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The setup placement Y coordinate</span>
setup.y         : real as <span class="org-variable-name">length</span> = 0.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The setup placement Z coordinate</span>
setup.z         : real as <span class="org-variable-name">length</span> = 0.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the material that fills the world volume</span>
material.ref    : <span class="org-variable-name">string</span> = <span class="org-string">"vacuum"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mapping directives for the 'setup' daughter volume</span>
mapping.daughter_id.setup : <span class="org-variable-name">string</span>  = <span class="org-string">"[lab.gc:area=0]"</span>
</pre>
</div>
</div>
</li></ul>
</div>
</div>
