geant4_validation/README.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Mapping categories</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of geometry ID categories/types</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "category"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>


<span class="org-comment-delimiter">##################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This is the mandatory top-level geometry category.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">One should always provide it :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"world"</span> <span class="org-variable-name">type</span>=<span class="org-string">"0"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of the top-level world volume</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The world's GID address is characterized by its 'world' number</span>
addresses : <span class="org-variable-name">string</span>[1] = <span class="org-string">"world"</span>


<span class="org-comment-delimiter">##################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This geometry category addresses an experimental area volume :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"lab.gc"</span>  <span class="org-variable-name">type</span>=<span class="org-string">"100"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of the experimental area volume (lab)</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description A lab's GID address is charaterized by its 'area' number</span>
addresses : <span class="org-variable-name">string</span>[1] = <span class="org-string">"area"</span>


<span class="org-comment-delimiter">################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This geometry category addresses a calibration source object :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"source.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"1000"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of a calibration source</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a calibration source is defined by its 'position' number</span>
addresses : <span class="org-variable-name">string</span>[1] = <span class="org-string">"position"</span>


<span class="org-comment-delimiter">##############################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This geometry category addresses the support frame of a calibration source :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"source_support.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"1010"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of a calibration source support</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a source support inherits the GID address of the source</span>
inherits : <span class="org-variable-name">string</span> = <span class="org-string">"source.gc"</span>


<span class="org-comment-delimiter">#################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This geometry category addresses of a calibration source film :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"source_film.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"1020"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of a calibration source film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a source film inherits the GID address of the source</span>
inherits : <span class="org-variable-name">string</span> = <span class="org-string">"source.gc"</span>


<span class="org-comment-delimiter">######################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This geometry category addresses an optical module :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"optical_module.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"2020"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of a calibration source film</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a column is defined by its 'detector' number</span>
addresses : <span class="org-variable-name">string</span>[1] = <span class="org-string">"detector"</span>


<span class="org-comment-delimiter">#################################################################################</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">This geometry category addresses the scintillator block of an optical module :</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"scin_block.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"2030"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of the scintillator block of an optical module</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a scin block inherits the GID address of the optical module</span>
inherits : <span class="org-variable-name">string</span> = <span class="org-string">"optical_module.gc"</span>


<span class="org-comment-delimiter">###############################################</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"scin_block_wrapping.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"2031"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of a wrapping film around a scintillator block</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a wrapping film extends GID address of the scintillator block</span>
extends : <span class="org-variable-name">string</span>[1] = <span class="org-string">"scin_block.gc"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The 'side' number extend the mother scintillator block GID address</span>
by       : <span class="org-variable-name">string</span>[1] = <span class="org-string">"side"</span>


<span class="org-comment-delimiter">#######################################</span>
[<span class="org-variable-name">category</span>=<span class="org-string">"light_guide.gc"</span> <span class="org-variable-name">type</span>=<span class="org-string">"2032"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The geometry category of the light guide</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The GID address of a light guide inherits the GID address of the optical module</span>
inherits : <span class="org-variable-name">string</span>[1] = <span class="org-string">"optical_module.gc"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Materials plugin</h3>
<div class="outline-text-3" id="text-3-4">
<p>
We use the definitions of isotopes, elements and materials from the installed
materials library. Here the <code>materials_aliases</code> definition are locally defined
to change the source foil isotope.
</p>
</div>
<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Plugin declaration</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The geometry manager plugin for materials</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label  "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"materials_driver"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::materials_plugin"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Logging priority</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Files</h4>
<div class="outline-text-4" id="text-3-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files describing the materials</span>
materials.configuration_files : string[4] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@materials:data/std_isotopes.def"</span>              <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@materials:data/std_elements.def"</span>              <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@materials:data/std_materials.def"</span>             <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/materials_aliases.def"</span>
</pre>
</div>
</div>
</div>
