geant4_validation/README.org
**** Bismuth 207
#+BEGIN_SRC sh
    [name="Bi-207" type="isotope"]
    #@config The 207 Bismuth isotope
    z : integer = 83
    a : integer = 207

    [name="bismuth-207" type="element"]
    #@config The 48 Calcium enriched element
    z               : integer   = 83
    isotope.names   : string[1] = "Bi-207"
    isotope.weights : real[1]   = 1.0

    [name="bi207_source_material" type="material"]
    #@config Bi207 material
    density        : real   = 9.78
    density.unit   : string = "g/cm3"
    state          : string = "solid"
    composition.mode          : string      = "fraction_mass"
    composition.names         : string [1]  = "bismuth-207"
    composition.fraction_mass : real   [1]  = 1.0
#+END_SRC

*** Material aliases
:PROPERTIES:
:TANGLE: config/geometry/materials_aliases.def
:END:
#+BEGIN_SRC sh
    #@description A sample list of aliases for standard materials
    #@key_label   "name"
    #@meta_label  "type"

    [name="air" type="alias"]
    #@description The alias for air
    material : string = "std::air"

    [name="aluminium" type="alias"]
    #@description The alias for aluminium
    material : string = "std::aluminium"

    [name="inox" type="alias"]
    #@description The alias for inox
    material : string = "std::inox"

    [name="copper" type="alias"]
    #@description The alias for copper
    material : string = "std::copper"

    [name="mylar" type="alias"]
    #@description The alias for mylar
    material : string = "std::mylar"

    [name="plexiglass" type="alias"]
    #@description The alias for plexiglass
    material : string = "std::plexiglass"

    [name="polystyrene" type="alias"]
    #@description The alias for polystyrene
    material : string = "std::polystyrene"

    [name="glass" type="alias"]
    #@description The alias for pyrex
    material : string = "std::pyrex"

    [name="vacuum" type="alias"]
    #@description The alias for vacuum
    material : string = "std::vacuum"

    [name="lab_medium" type="alias"]
    #@description The alias for air
    material : string = "std::air"
    #material : string = "std::vacuum"
#+END_SRC

** Magnetic field plugin
:PROPERTIES:
:TANGLE: config/geometry/magnetic_field_plugin.conf
:END:
*** Plugin declaration
#+BEGIN_SRC sh
  #@description The geometry manager plugin for emfield

  #@key_label  "name"
  #@meta_label "type"

  [name="fields_driver" type="emfield::emfield_geom_plugin"]
#+END_SRC

*** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

*** EM field manager configuration
#+BEGIN_SRC sh
  #@description Manager logging priority
  manager.logging.priority : string = "warning"

  #@description The name of the geometry service
  manager.services.geometry : string = "Geo"

  #@description List of EM fields definitions files
  manager.field_definitions_filenames : string[1] as path = \
      "@GEANT4_VALIDATION_DIR@/config/geometry/magnetic_field_drivers.conf"
#+END_SRC

EM field defined within =manager.field_definitions_filenames= file can be set
independently and at the same time for different G4 volumes. This association
between volumes and field is done by the =geom_map= object of =emfield=
component.
#+BEGIN_SRC sh
  #@description Flag to activate the geometry volume/field associations map
  manager.build_geom_map : boolean = 1

  #@description Manager logging priority
  manager.geom_map.logging.priority : string = "warning"

  #@description The list of EM fields associated to some logical volumes
  manager.geom_map.associations.labels : string[1] = "lab"

  #@description The logical model associated for the label 'tracker'
  manager.geom_map.associations.lab.volume : string = "lab.model.log"

  #@description The EM field associated for the label "tracker"
  manager.geom_map.associations.lab.field_name : string = "B0"
#+END_SRC

*** Magnetic fields
:PROPERTIES:
:TANGLE: config/geometry/magnetic_field_drivers.conf
:END:
**** Preamble
#+BEGIN_SRC sh
  #@description Definition parameters for some electro-magnetic fields
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** Constant magnetic field
#+BEGIN_SRC sh
  [name="B0" type="emfield::uniform_magnetic_field"]

  #@config Configuration parameters for the magnetic field generated by a coil

  #@description Default implicit magnetic field unit
  magnetic_field.unit        : string  = "gauss"

  #@description Coordinates of the static magnetic field (Bx, By, Bz)
  magnetic_field.coordinates : real[3] = 0.0 0.0 25.0
#+END_SRC

** Visualization settings
:PROPERTIES:
:MKDIRP: yes
:TANGLE: config/visualization/geant4_validation.sty
:END:
