geant4_validation/README.html

<div id="outline-container-sec-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> Material aliases</h4>
<div class="outline-text-4" id="text-3-4-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of aliases for standard materials</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"air"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for air</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::air"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"aluminium"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for aluminium</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::aluminium"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"inox"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for inox</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::inox"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"copper"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for copper</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::copper"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"mylar"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for mylar</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::mylar"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"plexiglass"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for plexiglass</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::plexiglass"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"polystyrene"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for polystyrene</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::polystyrene"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"glass"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for pyrex</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::pyrex"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"vacuum"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for vacuum</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::vacuum"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"lab_medium"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for air</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::air"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">material : string = "std::vacuum"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Magnetic field plugin</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Plugin declaration</h4>
<div class="outline-text-4" id="text-3-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The geometry manager plugin for emfield</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label  "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"fields_driver"</span> <span class="org-variable-name">type</span>=<span class="org-string">"emfield::emfield_geom_plugin"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Logging priority</h4>
<div class="outline-text-4" id="text-3-5-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> EM field manager configuration</h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Manager logging priority</span>
manager.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry service</span>
manager.services.geometry : <span class="org-variable-name">string</span> = <span class="org-string">"Geo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of EM fields definitions files</span>
manager.field_definitions_filenames : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/magnetic_field_drivers.conf"</span>
</pre>
</div>

<p>
EM field defined within <code>manager.field_definitions_filenames</code> file can be set
independently and at the same time for different G4 volumes. This association
between volumes and field is done by the <code>geom_map</code> object of <code>emfield</code>
component.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate the geometry volume/field associations map</span>
manager.build_geom_map : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Manager logging priority</span>
manager.geom_map.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of EM fields associated to some logical volumes</span>
manager.geom_map.associations.labels : <span class="org-variable-name">string</span>[1] = <span class="org-string">"lab"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The logical model associated for the label 'tracker'</span>
manager.geom_map.associations.lab.volume : <span class="org-variable-name">string</span> = <span class="org-string">"lab.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The EM field associated for the label "tracker"</span>
manager.geom_map.associations.lab.field_name : <span class="org-variable-name">string</span> = <span class="org-string">"B0"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> Magnetic fields</h4>
<div class="outline-text-4" id="text-3-5-4">
</div>
<ul class="org-ul"><li>Preamble<br  /><div class="outline-text-5" id="text-3-5-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Definition parameters for some electro-magnetic fields</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>Constant magnetic field<br  /><div class="outline-text-5" id="text-3-5-4-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"B0"</span> <span class="org-variable-name">type</span>=<span class="org-string">"emfield::uniform_magnetic_field"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration parameters for the magnetic field generated by a coil</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Default implicit magnetic field unit</span>
magnetic_field.unit        : <span class="org-variable-name">string</span>  = <span class="org-string">"gauss"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Coordinates of the static magnetic field (Bx, By, Bz)</span>
magnetic_field.coordinates : <span class="org-variable-name">real</span>[3] = 0.0 0.0 25.0
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Visualization settings</h3>
<div class="outline-text-3" id="text-3-6">
</div>
