geant4_validation/README.org
*** Browser settings
#+BEGIN_SRC sh
  [name="browser_settings"]

  #@description Setup label.
  setup_label : string = "geant4_validation"

  #@description Tab to view at startup.
  # 0: 3D Display 1: Raw Data 2: Options, 3: Selection
  startup_tab : integer = 0

  # 0: Top view 1: Front view 2: Side view
  startup_2d_view : integer = 0

  #@description Background color of displays.
  background_color : integer[3] =   0   0   0
#+END_SRC
*** Geometry settings
#+BEGIN_SRC sh
  [name="geometry_settings"]

  #@description List of volumes to take care.
  volume_category_list : string[8] =                          \
                                     "lab.gc"                 \
                                     "light_guide.gc"         \
                                     "optical_module.gc"      \
                                     "scin_block.gc"          \
                                     "scin_block_wrapping.gc" \
                                     "source.gc"              \
                                     "source_film.gc"         \
                                     "source_support.gc"

  #@description Volume visibility (visible/invisible/disable)
  lab.gc.visibility                 : string = "invisible"
  light_guide.gc.visibility         : string = "invisible"
  optical_module.gc.visibility      : string = "invisible"
  scin_block.gc.visibility          : string = "visible"
  scin_block_wrapping.gc.visibility : string = "invisible"
  source.gc.visibility              : string = "visible"
  source_film.gc.visibility         : string = "visible"
  source_support.gc.visibility      : string = "visible"

  #@description Volume color
  lab.gc.color                 : integer[3] = 228 123 220
  light_guide.gc.color         : integer[3] = 158 246 222
  optical_module.gc.color      : integer[3] = 141  17  79
  scin_block.gc.color          : integer[3] = 144  17 179
  scin_block_wrapping.gc.color : integer[3] =  86 111 124
  source.gc.color              : integer[3] = 236  33 141
  source_film.gc.color         : integer[3] = 163  44  34
  source_support.gc.color      : integer[3] =  90 156 254
#+END_SRC
*** Particle settings
#+BEGIN_SRC sh
  [name="particle_settings"]

  #@description MC particle color
  gamma.color    : string = "#FFD700"
  electron.color : string = "#87CEEB"
#+END_SRC
*** Misc.
#+BEGIN_SRC sh
  [name="miscellaneous"]

  #@description MC line style
  mc_line_style : integer = 1
  mc_line_width : integer = 0

  #@description Figure save options
  save.directory : string = "."
  save.extension : string = ".eps"
  save.prefix    : string = "event_"
#+END_SRC

* Simulation setup
** Geant4 configuration
:PROPERTIES:
:TANGLE: config/pipeline/g4_manager.conf
:END:
*** Manager setup
#+BEGIN_SRC sh
  [name="manager"]

  #@description Logging priority
  logging.priority      : string = "warning"
#+END_SRC
*** Event generator
The following code holds the =genbb= manager to give access to several primary
generators.
#+BEGIN_SRC sh
  [name="event_generator"]

  #@description Configuration file for the embedded '::genbb::manager'
  manager.config : string as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/genbb_manager.conf"
#+END_SRC
*** Vertex generator
This part basically provides the location of vertex generator implemented by
[[https://nemo.lpc-caen.in2p3.fr/wiki/genvtx][genvtx]].
#+BEGIN_SRC sh
  [name="vertex_generator"]

  #@description Main configuration file for the vertex generator manager
  manager.config : string as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/genvertex_manager.conf"
#+END_SRC
*** Detector construction
#+BEGIN_SRC sh
  [name="detector_construction"]
#+END_SRC
**** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

**** GDML scheme and options
The Geometry Description Markup Language is an application-indepedent geometry
description format based on XML[1]. It is used as Geant4 toolkit bindings
through =gemotools= converters.

#+BEGIN_SRC sh
  #@description Temporary directory for GDML file generation:
  gdml.tmp_dir         : string as path = "/tmp/${USER}/geant4_validation_g4.d"

  #@description Access mode to the GDML schema ("local" or "remote")
  gdml.schema_location : string = "local" # "remote"

  #@description Flag to skip GDML validation
  gdml.no_validation   : boolean = 0
#+END_SRC

[1] http://gdml.web.cern.ch/GDML

