geant4_validation/README.html
<div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Browser settings</h4>
<div class="outline-text-4" id="text-3-6-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"browser_settings"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup label.</span>
setup_label : <span class="org-variable-name">string</span> = <span class="org-string">"geant4_validation"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Tab to view at startup.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">0: 3D Display 1: Raw Data 2: Options, 3: Selection</span>
startup_tab : <span class="org-variable-name">integer</span> = 0

<span class="org-comment-delimiter"># </span><span class="org-comment">0: Top view 1: Front view 2: Side view</span>
startup_2d_view : <span class="org-variable-name">integer</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Background color of displays.</span>
background_color : <span class="org-variable-name">integer</span>[3] =   0   0   0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> Geometry settings</h4>
<div class="outline-text-4" id="text-3-6-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"geometry_settings"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of volumes to take care.</span>
volume_category_list : <span class="org-variable-name">string</span>[8] =                          <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"lab.gc"</span>                 <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"light_guide.gc"</span>         <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"optical_module.gc"</span>      <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"scin_block.gc"</span>          <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"scin_block_wrapping.gc"</span> <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"source.gc"</span>              <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"source_film.gc"</span>         <span class="org-sh-escaped-newline">\</span>
                                   <span class="org-string">"source_support.gc"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Volume visibility (visible/invisible/disable)</span>
lab.gc.visibility                 : <span class="org-variable-name">string</span> = <span class="org-string">"invisible"</span>
light_guide.gc.visibility         : <span class="org-variable-name">string</span> = <span class="org-string">"invisible"</span>
optical_module.gc.visibility      : <span class="org-variable-name">string</span> = <span class="org-string">"invisible"</span>
scin_block.gc.visibility          : <span class="org-variable-name">string</span> = <span class="org-string">"visible"</span>
scin_block_wrapping.gc.visibility : <span class="org-variable-name">string</span> = <span class="org-string">"invisible"</span>
source.gc.visibility              : <span class="org-variable-name">string</span> = <span class="org-string">"visible"</span>
source_film.gc.visibility         : <span class="org-variable-name">string</span> = <span class="org-string">"visible"</span>
source_support.gc.visibility      : <span class="org-variable-name">string</span> = <span class="org-string">"visible"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Volume color</span>
lab.gc.color                 : <span class="org-variable-name">integer</span>[3] = 228 123 220
light_guide.gc.color         : <span class="org-variable-name">integer</span>[3] = 158 246 222
optical_module.gc.color      : <span class="org-variable-name">integer</span>[3] = 141  17  79
scin_block.gc.color          : <span class="org-variable-name">integer</span>[3] = 144  17 179
scin_block_wrapping.gc.color : <span class="org-variable-name">integer</span>[3] =  86 111 124
source.gc.color              : <span class="org-variable-name">integer</span>[3] = 236  33 141
source_film.gc.color         : <span class="org-variable-name">integer</span>[3] = 163  44  34
source_support.gc.color      : <span class="org-variable-name">integer</span>[3] =  90 156 254
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> Particle settings</h4>
<div class="outline-text-4" id="text-3-6-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"particle_settings"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description MC particle color</span>
gamma.color    : <span class="org-variable-name">string</span> = <span class="org-string">"#FFD700"</span>
electron.color : <span class="org-variable-name">string</span> = <span class="org-string">"#87CEEB"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6-4" class="outline-4">
<h4 id="sec-3-6-4"><span class="section-number-4">3.6.4</span> Misc.</h4>
<div class="outline-text-4" id="text-3-6-4">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"miscellaneous"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description MC line style</span>
mc_line_style : <span class="org-variable-name">integer</span> = 1
mc_line_width : <span class="org-variable-name">integer</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Figure save options</span>
save.directory : <span class="org-variable-name">string</span> = <span class="org-string">"."</span>
save.extension : <span class="org-variable-name">string</span> = <span class="org-string">".eps"</span>
save.prefix    : <span class="org-variable-name">string</span> = <span class="org-string">"event_"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Simulation setup</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Geant4 configuration</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Manager setup</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"manager"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority      : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Event generator</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The following code holds the <code>genbb</code> manager to give access to several primary
generators.
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"event_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file for the embedded '::genbb::manager'</span>
manager.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/genbb_manager.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Vertex generator</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
This part basically provides the location of vertex generator implemented by
<a href="https://nemo.lpc-caen.in2p3.fr/wiki/genvtx">genvtx</a>.
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"vertex_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Main configuration file for the vertex generator manager</span>
manager.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/genvertex_manager.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> Detector construction</h4>
<div class="outline-text-4" id="text-4-1-4">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"detector_construction"</span>]
</pre>
</div>
</div>
<ul class="org-ul"><li>Logging priority<br  /><div class="outline-text-5" id="text-4-1-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>GDML scheme and options<br  /><div class="outline-text-5" id="text-4-1-4-2">
<p>
The Geometry Description Markup Language is an application-indepedent geometry
description format based on XML<sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>. It is used as Geant4 toolkit bindings
through <code>gemotools</code> converters.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Temporary directory for GDML file generation:</span>
gdml.tmp_dir         : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/geant4_validation_g4.d"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Access mode to the GDML schema ("local" or "remote")</span>
gdml.schema_location : <span class="org-variable-name">string</span> = <span class="org-string">"local"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">"remote"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to skip GDML validation</span>
gdml.no_validation   : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</li>
<li>Step hit processors<br  /><div class="outline-text-5" id="text-4-1-4-3">
<p>
