geant4_validation/README.org
**** Step hit processors
Step hit processors are used to convert Geant4 steps into detector hits for
SuperNEMO physics.
#+BEGIN_SRC sh
  #@description Logging support for step hit processor factory
  hit_processor_factory.logging.priority : string = "warning"

  #@description Configuration file for the step hit processor factory:
  hit_processor_factory.config : string as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/step_hit_processor_factory.conf"
#+END_SRC

**** Sensitive detectors
This category defines sensitive detectors where special treatments of Geant4 steps
must be applied. This can be in direct relation with step hit processors defined above.
#+BEGIN_SRC sh
  #@description Parameters for the generation of 'sensitive hits' through 'sensitive detectors' :
  sensitive.detectors : string[1] = "scin_SD"

  #@description Logging priority
  sensitive.scin_SD.logging.priority                : string  = "warning"

  #@description Buffer capacity for hits
  sensitive.scin_SD.hits_buffer_capacity            : integer = 200

  #@description Flag to activate the recording of alpha particle quenching
  sensitive.scin_SD.record_alpha_quenching          : boolean = 1

  #@description Flag to activate the recording of any track ID
  sensitive.scin_SD.record_track_id                 : boolean = 1

  #@description Flag to activate the recording of any primary particle flag
  sensitive.scin_SD.record_primary_particle         : boolean = 1

  #@description Flag to drop hits with zero energy deposit
  sensitive.scin_SD.drop_zero_energy_deposit_steps  : boolean = 0

  #@description Flag to track gamma particles
  sensitive.scin_SD.track_gamma                     : boolean = 1
#+END_SRC

**** Geant4 step hit limits
The following code defines geometry models where Geant4 steps are size limited.
#+BEGIN_SRC sh
  #@description List of geometry logical volumes with max steps:
  limits.list_of_volumes : string[3] = \
                         "source_film.model.log" \
                         "scintillator_block.model.log" \
                         "lab.model.log"

  #@description Max step length inside source pad:
  limits.max_step.source_film.model.log        : real as length = 5 um

  #@description Max step length inside scintillator block:
  limits.max_step.scintillator_block.model.log : real as length = 100 um

  #@description Max step length inside lab volume:
  limits.max_step.lab.model.log                : real as length = 1 cm
#+END_SRC
**** Geant4 regions
Definition of Geant4 regions.
#+BEGIN_SRC sh
  #@description List of regions
  regions : string[3] = "scintillator" "lab" "source"

  #@description List of attached volumes/models for region "scintillator"
  regions.scintillator.volumes : string[1] = "scintillator_block.model.log"

  #@description List of attached volumes/models for region "lab"
  regions.lab.volumes          : string[2] = "lab.model.log" "source.model.log"

  #@description List of attached volumes/models for region "source"
  regions.source.volumes       : string[1] = "source_film.model.log"
#+END_SRC

**** Magnetic field
#+BEGIN_SRC sh
  #@description Flag to use magnetic field
  using_magnetic_field              : boolean = 0

  #@description Logging priority threshold of the embedded Geant4 magnetic fields
  magnetic_field.logging.priority   : string = "warning"

  #@description Name of the magnetic field geometry plugin
  magnetic_field.plugin_name        : string = "fields_driver"

  #@description Name of the associated fields
  magnetic_field.associations       : string[1] = "module"

  #@description SetDeltaChord miss distance (mm):
  magnetic_field.miss_distance : real as length = 0.5 mm
#+END_SRC

*** Physics list
In the development of a Geant4-based application, it is the user's
responsibility to decide which physics processes are required, and then to
include them in the physics list. The next lines are just aliases to relevant
phycical processes for SuperNEMO.
#+BEGIN_SRC sh
  [name="physics_list"]
#+END_SRC

**** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

**** Plugins
#+BEGIN_SRC sh
  #@description List of physics constructors
  physics_constructors.names : string[2] = "particles" "em"

  #@description Class ID of the physics constructors named 'particles'
  physics_constructors.particles.id     : string = "mctools::g4::particles_physics_constructor"

  #@description Configuration file of the physics constructors named 'particles'
  physics_constructors.particles.config : string as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/particles.conf"

  #@description Class ID of the physics constructors named 'em'
  physics_constructors.em.id            : string = "mctools::g4::em_physics_constructor"

  #@description Configuration file of the physics constructors named 'em'
  physics_constructors.em.config        : string as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/em_processes.conf"
#+END_SRC

