geant4_validation/README.html
Step hit processors are used to convert Geant4 steps into detector hits for
SuperNEMO physics.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging support for step hit processor factory</span>
hit_processor_factory.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file for the step hit processor factory:</span>
hit_processor_factory.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/step_hit_processor_factory.conf"</span>
</pre>
</div>
</div>
</li>
<li>Sensitive detectors<br  /><div class="outline-text-5" id="text-4-1-4-4">
<p>
This category defines sensitive detectors where special treatments of Geant4 steps
must be applied. This can be in direct relation with step hit processors defined above.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Parameters for the generation of 'sensitive hits' through 'sensitive detectors' :</span>
sensitive.detectors : <span class="org-variable-name">string</span>[1] = <span class="org-string">"scin_SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
sensitive.scin_SD.logging.priority                : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Buffer capacity for hits</span>
sensitive.scin_SD.hits_buffer_capacity            : <span class="org-variable-name">integer</span> = 200

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate the recording of alpha particle quenching</span>
sensitive.scin_SD.record_alpha_quenching          : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate the recording of any track ID</span>
sensitive.scin_SD.record_track_id                 : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate the recording of any primary particle flag</span>
sensitive.scin_SD.record_primary_particle         : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to drop hits with zero energy deposit</span>
sensitive.scin_SD.drop_zero_energy_deposit_steps  : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to track gamma particles</span>
sensitive.scin_SD.track_gamma                     : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li>
<li>Geant4 step hit limits<br  /><div class="outline-text-5" id="text-4-1-4-5">
<p>
The following code defines geometry models where Geant4 steps are size limited.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of geometry logical volumes with max steps:</span>
limits.list_of_volumes : <span class="org-variable-name">string</span>[3] = <span class="org-sh-escaped-newline">\</span>
                       <span class="org-string">"source_film.model.log"</span> <span class="org-sh-escaped-newline">\</span>
                       <span class="org-string">"scintillator_block.model.log"</span> <span class="org-sh-escaped-newline">\</span>
                       <span class="org-string">"lab.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside source pad:</span>
limits.max_step.source_film.model.log        : real as <span class="org-variable-name">length</span> = 5 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside scintillator block:</span>
limits.max_step.scintillator_block.model.log : real as <span class="org-variable-name">length</span> = 100 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside lab volume:</span>
limits.max_step.lab.model.log                : real as <span class="org-variable-name">length</span> = 1 cm
</pre>
</div>
</div>
</li>

<li>Geant4 regions<br  /><div class="outline-text-5" id="text-4-1-4-6">
<p>
Definition of Geant4 regions.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of regions</span>
regions : <span class="org-variable-name">string</span>[3] = <span class="org-string">"scintillator"</span> <span class="org-string">"lab"</span> <span class="org-string">"source"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for region "scintillator"</span>
regions.scintillator.volumes : <span class="org-variable-name">string</span>[1] = <span class="org-string">"scintillator_block.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for region "lab"</span>
regions.lab.volumes          : <span class="org-variable-name">string</span>[2] = <span class="org-string">"lab.model.log"</span> <span class="org-string">"source.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for region "source"</span>
regions.source.volumes       : <span class="org-variable-name">string</span>[1] = <span class="org-string">"source_film.model.log"</span>
</pre>
</div>
</div>
</li>
<li>Magnetic field<br  /><div class="outline-text-5" id="text-4-1-4-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to use magnetic field</span>
using_magnetic_field              : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority threshold of the embedded Geant4 magnetic fields</span>
magnetic_field.logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Name of the magnetic field geometry plugin</span>
magnetic_field.plugin_name        : <span class="org-variable-name">string</span> = <span class="org-string">"fields_driver"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Name of the associated fields</span>
magnetic_field.associations       : <span class="org-variable-name">string</span>[1] = <span class="org-string">"module"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description SetDeltaChord miss distance (mm):</span>
magnetic_field.miss_distance : real as <span class="org-variable-name">length</span> = 0.5 mm
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4">4.1.5</span> Physics list</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
In the development of a Geant4-based application, it is the user's
responsibility to decide which physics processes are required, and then to
include them in the physics list. The next lines are just aliases to relevant
phycical processes for SuperNEMO.
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"physics_list"</span>]
</pre>
</div>
</div>

<ul class="org-ul"><li>Logging priority<br  /><div class="outline-text-5" id="text-4-1-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>Plugins<br  /><div class="outline-text-5" id="text-4-1-5-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of physics constructors</span>
physics_constructors.names : <span class="org-variable-name">string</span>[2] = <span class="org-string">"particles"</span> <span class="org-string">"em"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Class ID of the physics constructors named 'particles'</span>
physics_constructors.particles.id     : <span class="org-variable-name">string</span> = <span class="org-string">"mctools::g4::particles_physics_constructor"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file of the physics constructors named 'particles'</span>
physics_constructors.particles.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/particles.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Class ID of the physics constructors named 'em'</span>
physics_constructors.em.id            : <span class="org-variable-name">string</span> = <span class="org-string">"mctools::g4::em_physics_constructor"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file of the physics constructors named 'em'</span>
physics_constructors.em.config        : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/em_processes.conf"</span>
</pre>
</div>
</div>
