geant4_validation/README.org
***** Particle physics constructor
:PROPERTIES:
:TANGLE:   config/pipeline/particles.conf
:END:
Quite experimental try to set particles used within this "framework".
#+BEGIN_SRC sh
  #@config Configuration parameters for the particles Geant4 physics constructor

  #@description The activation flag for geantinos (neutral and charged, default: 0)
  #use_geantinos               : boolean = 0

  #@description The activation flag for optical photons (default: 0)
  #use_optical_photons         : boolean = 0

  #@description The activation flag for muon leptons (default: 0)
  #use_muon_leptons         : boolean = 0

  #@description The activation flag for tau leptons (default: 0)
  #use_tau_leptons          : boolean = 0

  #@description The activation flag for light mesons (default: 0)
  #use_light_mesons         : boolean = 0

  #@description The activation flag for charm mesons (default: 0)
  #use_charm_mesons         : boolean = 0

  #@description The activation flag for bottom mesons (default: 0)
  #use_bottom_mesons        : boolean = 0

  #@description The activation flag for nucleons (default: 1)
  use_nucleons             : boolean = 1

  #@description The activation flag for strange baryons (default: 0)
  #use_strange_baryons      : boolean = 0

  #@description The activation flag for charm baryons (default: 0)
  #use_charm_baryons        : boolean = 0

  #@description The activation flag for bottom baryons (default: 0)
  #use_bottom_baryons       : boolean = 0

  #@description The activation flag for light nuclei (default: 1)
  use_light_nuclei         : boolean = 1

  #@description The activation flag for light anti-nuclei (default: 0)
  #use_light_anti_nuclei    : boolean = 0

  #@description The activation flag for generic ion (default: 0)
  use_generic_ion          : boolean = 1
#+END_SRC

***** EM physics process
:PROPERTIES:
:TANGLE:   config/pipeline/em_processes.conf
:END:
****** General settings
#+BEGIN_SRC sh
  #@config Configuration parameters for the electro-magnetic Geant4 physics constructor

  #@description Electro-magntox interaction model (value in: "standard", "low_energy", "penelope")
  em.model : string = "standard"
#+END_SRC
****** Electrons/positrons
#+BEGIN_SRC sh
  #@description The activation flag for electron/positron ionisation (energy loss/delta ray production)
  em.electron.ionisation           : boolean = 1

  #@description The activation flag for electron/positron multiple scatterring process
  em.electron.multiple_scatterring : boolean = 1

  #@description The activation flag for electron/positron multiple scatterring process
  em.electron.multiple_scatterring.use_distance_to_boundary: boolean = 1

  #@description The range factor for electron/positron multiple scatterring process
  em.electron.multiple_scatterring.range_factor: real = 0.005

  #@description The activation flag for electron/positron bremsstrahlung process
  em.electron.bremsstrahlung       : boolean = 1

  #@description The activation flag for electron/positron step limiter process
  em.electron.step_limiter         : boolean = 1

  #@description The activation flag for positron pannihilation
  em.positron.annihilation         : boolean = 1
#+END_SRC
****** Gammas
#+BEGIN_SRC sh
  #@description The activation flag for Rayleigh scattering
  em.gamma.rayleigh_scattering  : boolean = 0

  #@description The activation flag for photoelectric effect
  em.gamma.photo_electric       : boolean = 1

  #@description The activation flag for Compton scattering
  em.gamma.compton_scattering   : boolean = 1

  #@description The activation flag for gamma conversion
  em.gamma.conversion           : boolean = 1

  #@description The activation flag for gamma conversion to muons
  em.gamma.conversion_to_muons  : boolean = 0
#+END_SRC
****** Muons
#+BEGIN_SRC sh
  #@description The activation flag for muon ionisation
  em.muon.ionisation           : boolean = 0

  #@description The activation flag for muon multiple scatterring process
  em.muon.multiple_scatterring : boolean = 0

  #@description The activation flag for muon pair production
  em.muon.pair_production      : boolean = 0

  #@description The activation flag for muon bremsstrahlung process
  em.muon.bremsstrahlung       : boolean = 0

  #@description The activation flag for muon step limiter process
  em.muon.step_limiter         : boolean = 0
#+END_SRC
****** Ions
#+BEGIN_SRC sh
  #@description The activation flag for ion ionisation
  em.ion.ionisation           : boolean = 1

  #@description The activation flag for ion multiple scatterring process
  em.ion.multiple_scatterring : boolean = 1

  #@description The activation flag for ion step limiter process
  em.ion.step_limiter         : boolean = 1
#+END_SRC
