geant4_validation/README.html

<ul class="org-ul"><li>Particle physics constructor<br  /><div class="outline-text-6" id="text-4-1-5-2-1">
<p>
Quite experimental try to set particles used within this "framework".
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration parameters for the particles Geant4 physics constructor</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for geantinos (neutral and charged, default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_geantinos               : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for optical photons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_optical_photons         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon leptons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_muon_leptons         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for tau leptons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_tau_leptons          : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_light_mesons         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for charm mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_charm_mesons         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for bottom mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_bottom_mesons        : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for nucleons (default: 1)</span>
use_nucleons             : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for strange baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_strange_baryons      : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for charm baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_charm_baryons        : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for bottom baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_bottom_baryons       : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light nuclei (default: 1)</span>
use_light_nuclei         : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light anti-nuclei (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_light_anti_nuclei    : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for generic ion (default: 0)</span>
use_generic_ion          : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li>
<li>EM physics process<br  /><div class="outline-text-6" id="text-4-1-5-2-2">
</div>
<ul class="org-ul"><li>General settings<br  /><div class="outline-text-7" id="text-4-1-5-2-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration parameters for the electro-magnetic Geant4 physics constructor</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Electro-magntox interaction model (value in: "standard", "low_energy", "penelope")</span>
em.model : <span class="org-variable-name">string</span> = <span class="org-string">"standard"</span>
</pre>
</div>
</div>
</li>

<li>Electrons/positrons<br  /><div class="outline-text-7" id="text-4-1-5-2-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron ionisation (energy loss/delta ray production)</span>
em.electron.ionisation           : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring.use_distance_to_boundary: <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The range factor for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring.range_factor: <span class="org-variable-name">real</span> = 0.005

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron bremsstrahlung process</span>
em.electron.bremsstrahlung       : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron step limiter process</span>
em.electron.step_limiter         : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for positron pannihilation</span>
em.positron.annihilation         : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li>

<li>Gammas<br  /><div class="outline-text-7" id="text-4-1-5-2-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Rayleigh scattering</span>
em.gamma.rayleigh_scattering  : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for photoelectric effect</span>
em.gamma.photo_electric       : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Compton scattering</span>
em.gamma.compton_scattering   : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for gamma conversion</span>
em.gamma.conversion           : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for gamma conversion to muons</span>
em.gamma.conversion_to_muons  : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</li>

<li>Muons<br  /><div class="outline-text-7" id="text-4-1-5-2-2-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon ionisation</span>
em.muon.ionisation           : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon multiple scatterring process</span>
em.muon.multiple_scatterring : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon pair production</span>
em.muon.pair_production      : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon bremsstrahlung process</span>
em.muon.bremsstrahlung       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon step limiter process</span>
em.muon.step_limiter         : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</li>

<li>Ions<br  /><div class="outline-text-7" id="text-4-1-5-2-2-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion ionisation</span>
em.ion.ionisation           : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion multiple scatterring process</span>
em.ion.multiple_scatterring : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion step limiter process</span>
em.ion.step_limiter         : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li>

<li>Deexcitation<br  /><div class="outline-text-7" id="text-4-1-5-2-2-6">
