geant4_validation/README.org
****** Deexcitation
#+BEGIN_SRC sh
  #@description The activation flag for deexcitation fluorescence process
  #em.deexcitation.fluo         : boolean = 0

  #@description The activation flag for Auger process
  #em.deexcitation.auger        : boolean = 0

  #@description The activation flag for PIXE
  #em.deexcitation.pixe         : boolean = 0

  #@description The activation model for PIXE cross-sections
  #em.deexcitation.pixe.model   : string = "Empirical"

  #@description The regions where to apply some deexcitation process
  #em.deexcitation.regions : string[2] = "A" "B"

  #@description The activation flag for deexcitation fluorescence process in region "A"
  #em.deexcitation.regions.A.fluo  : boolean = 1

  #@description The activation flag for Auger process in region "A"
  #em.deexcitation.regions.A.auger : boolean = 1

  #@description The activation flag for PIXE in region "A"
  #em.deexcitation.regions.A.pixe  : boolean = 1

  #@description The activation flag for deexcitation fluorescence process in region "B"
  #em.deexcitation.regions.B.fluo  : boolean = 1

  #@description The activation flag for Auger process in region "B"
  #em.deexcitation.regions.B.auger : boolean = 1

  #@description The activation flag for PIXE in region "B"
  #em.deexcitation.regions.B.pixe  : boolean = 1
#+END_SRC

**** Using Geant4 region cuts
These cuts are related to some production processes and then, define some
minimal step hit size given the detector region.
#+BEGIN_SRC sh
  #@description Activate the use of specific cuts
  using_production_cuts : boolean = 1

  #@description The energy low edge for cuts
  production_cuts.low_energy    : real as energy  = 1 keV

  #@description The energy high edge for cuts
  production_cuts.high_energy   : real as energy = 100 MeV

  #@description The production cut default value
  production_cuts.default_value : real as length = 1.0 mm

  #@description The production cut for gamma
  production_cuts.gamma : real as length = 1.0 mm

  #@description The production cut for electron
  production_cuts.electron : real as length = 1.0 mm

  #@description The production cut for positron
  production_cuts.positron : real as length = 1.0 mm

  #@description The production cut for proton
  production_cuts.proton : real as length = 1.0 mm

  #@description List of region with production cut
  production_cuts.regions : string[3] = "scintillator" "lab" "source"

  #@description Production cut value for region "calorimeter"
  production_cuts.regions.scintillator.gamma : real as length = 1.0 mm

  #@description Production cut value for region "calorimeter"
  production_cuts.regions.scintillator.electron : real as length = 1.0 mm

  #@description Production cut value for region "tracker"
  production_cuts.regions.lab.gamma : real as length = 0.5 mm

  #@description Production cut value for region "tracker"
  production_cuts.regions.lab.electron : real as length = 0.5 mm

  #@description Production cut value for region "source"
  production_cuts.regions.source.gamma : real as length = 0.05 mm

  #@description Production cut value for region "source"
  production_cuts.regions.source.electron : real as length = 0.05 mm
#+END_SRC

*** Geant4 related action
The last part of the configuration concerned Geant4 actions but do not hold a
lot of options.

**** Run action
#+BEGIN_SRC sh
  [name="run_action"]

  #@description Logging priority :
  logging.priority : string = "warning"

  #@description Run action event number print modulo :
  #number_events_modulo : integer = 100

  #@description If set, this flag forbids the generation of output files :
  file.no_save : boolean = 1
#+END_SRC

**** Event action
#+BEGIN_SRC sh
  [name="event_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

**** Primary generator action
#+BEGIN_SRC sh
  [name="primary_generator_action"]

  #@config Configuration of the primary generator action

  #@description Primary generator action logging priority
  logging.priority : string = "warning"
#+END_SRC
**** Tracking action
#+BEGIN_SRC sh
  [name="tracking_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

**** Stepping action
#+BEGIN_SRC sh
  [name="stepping_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

