geant4_validation/README.html
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.fluo         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.auger        : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.pixe         : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation model for PIXE cross-sections</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.pixe.model   : string = "Empirical"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The regions where to apply some deexcitation process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions : string[2] = "A" "B"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.fluo  : boolean = 1</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.auger : boolean = 1</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.pixe  : boolean = 1</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.fluo  : boolean = 1</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.auger : boolean = 1</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.pixe  : boolean = 1</span>
</pre>
</div>
</div>
</li></ul>
</li></ul>
</li>
<li>Using Geant4 region cuts<br  /><div class="outline-text-5" id="text-4-1-5-3">
<p>
These cuts are related to some production processes and then, define some
minimal step hit size given the detector region.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Activate the use of specific cuts</span>
using_production_cuts : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The energy low edge for cuts</span>
production_cuts.low_energy    : real as <span class="org-variable-name">energy</span>  = 1 keV

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The energy high edge for cuts</span>
production_cuts.high_energy   : real as <span class="org-variable-name">energy</span> = 100 MeV

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut default value</span>
production_cuts.default_value : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for gamma</span>
production_cuts.gamma : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for electron</span>
production_cuts.electron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for positron</span>
production_cuts.positron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for proton</span>
production_cuts.proton : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of region with production cut</span>
production_cuts.regions : <span class="org-variable-name">string</span>[3] = <span class="org-string">"scintillator"</span> <span class="org-string">"lab"</span> <span class="org-string">"source"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "calorimeter"</span>
production_cuts.regions.scintillator.gamma : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "calorimeter"</span>
production_cuts.regions.scintillator.electron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "tracker"</span>
production_cuts.regions.lab.gamma : real as <span class="org-variable-name">length</span> = 0.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "tracker"</span>
production_cuts.regions.lab.electron : real as <span class="org-variable-name">length</span> = 0.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "source"</span>
production_cuts.regions.source.gamma : real as <span class="org-variable-name">length</span> = 0.05 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "source"</span>
production_cuts.regions.source.electron : real as <span class="org-variable-name">length</span> = 0.05 mm
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-4-1-6" class="outline-4">
<h4 id="sec-4-1-6"><span class="section-number-4">4.1.6</span> Geant4 related action</h4>
<div class="outline-text-4" id="text-4-1-6">
<p>
The last part of the configuration concerned Geant4 actions but do not hold a
lot of options.
</p>
</div>

<ul class="org-ul"><li>Run action<br  /><div class="outline-text-5" id="text-4-1-6-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"run_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Run action event number print modulo :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">number_events_modulo : integer = 100</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description If set, this flag forbids the generation of output files :</span>
file.no_save : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li>
<li>Event action<br  /><div class="outline-text-5" id="text-4-1-6-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"event_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>Primary generator action<br  /><div class="outline-text-5" id="text-4-1-6-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"primary_generator_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration of the primary generator action</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Primary generator action logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>

<li>Tracking action<br  /><div class="outline-text-5" id="text-4-1-6-4">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"tracking_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
<li>Stepping action<br  /><div class="outline-text-5" id="text-4-1-6-5">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"stepping_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</li>
