geant4_validation/README.org
**** Stacking action
#+BEGIN_SRC sh
  [name="stacking_action"]

  #@description Logging priority :
  logging.priority : string = "warning"

  #@description Kill secondary particles within some volumes :
  # kill_particles : boolean = 0

  #@description Kill secondary particles within some volumes :
  #kill_particles.volumes : string[1] = "drift_cell_core"

  #@description Kill secondary particles within some materials :
  #kill_particles.materials : string[1] = "tracking_gas"
#+END_SRC

** Genbb configuration
:PROPERTIES:
:TANGLE: config/pipeline/genbb_manager.conf
:END:
The =genbb= package is dedicated to the generation of double beta decay and/or
radioactive background primary events as input for a simulation program.

More details concerning the use of =genbb= can be found in [[https://nemo.lpc-caen.in2p3.fr/wiki/genbb_help][LPC wiki]].
#+BEGIN_SRC sh
  #@config Main configuration parameters for the genbb manager

  #@description Logging priority
  logging.priority : string = "warning"

  #@description List of files containing particle generator definition rules
  generators.configuration_files : string[2] as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/calibrations.conf" \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/guns.conf"
#+END_SRC
*** Calibration configuration
:PROPERTIES:
:TANGLE:   config/pipeline/calibrations.conf
:END:
**** Insert preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** Bi207
#+BEGIN_SRC sh
  [name="Bi207" type="genbb::wdecay0"]
  #@config Bi-207 decay
  logging.priority : string = "warning"
  decay_type       : string = "background"
  decay_isotope    : string = "Bi207+Pb207m"
#+END_SRC
**** Co60
#+BEGIN_SRC sh
  [name="Co60" type="genbb::wdecay0"]
  #@config Co-60 decay
  logging.priority : string = "warning"
  decay_type       : string = "background"
  decay_isotope    : string = "Co60"
#+END_SRC
*** Guns configuration
:PROPERTIES:
:TANGLE: config/pipeline/guns.conf
:END:
**** Insert preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** 1 MeV electron
#+BEGIN_SRC sh
  [name="electron_1MeV" type="genbb::single_particle_generator"]
  #@config Electron with monokinetic energy @ 1 MeV [miscellaneous]

  #@description Seed for the embedded random number generator:
  #seed          : integer = 314159

  #@description Generated particle ("electron", "positron", "gamma", "alpha"):
  particle_name : string = "electron"

  #@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):
  mode          : string = "monokinetic"

  #@description Direction of the emitted particle
  emission_direction : string = "randomized"

  #@description The kinetic energy of the generated particle
  energy        : real as energy  = 1000 keV
#+END_SRC
**** 1 MeV cone electron
#+BEGIN_SRC sh
  [name="electron_1MeV_cone" type="genbb::single_particle_generator"]
  #@config Electron with monokinetic energy @ 1 MeV [miscellaneous]

  #@description Generated particle ("electron", "positron", "gamma", "alpha"):
  particle_name : string = "electron"

  #@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):
  mode          : string = "monokinetic"

  #@description Direction of the emitted particle
  emission_direction : string = "cone"

  #@description The emission cone axis (values: "+x", "-x", "+y", "-y", "+z", "-z", "30.0 45.0 degree")
  cone.axis : string = "-x"

  #@description The default implicit angle unit
  angle_unit : string = "degree"

  #@description The minimum emission angle (cone)
  cone.min_angle : real as angle = 0 degree

  #@description The maximum emission angle (cone)
  cone.max_angle : real as angle = 10 degree

  #@description The kinetic energy of the generated particle
  energy        : real as energy = 1000 keV
#+END_SRC

