geant4_validation/README.html
<li>Stacking action<br  /><div class="outline-text-5" id="text-4-1-6-6">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"stacking_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some volumes :</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">kill_particles : boolean = 0</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some volumes :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">kill_particles.volumes : string[1] = "drift_cell_core"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some materials :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">kill_particles.materials : string[1] = "tracking_gas"</span>
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Genbb configuration</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The <code>genbb</code> package is dedicated to the generation of double beta decay and/or
radioactive background primary events as input for a simulation program.
</p>

<p>
More details concerning the use of <code>genbb</code> can be found in <a href="https://nemo.lpc-caen.in2p3.fr/wiki/genbb_help">LPC wiki</a>.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Main configuration parameters for the genbb manager</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files containing particle generator definition rules</span>
generators.configuration_files : string[2] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/calibrations.conf"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/guns.conf"</span>
</pre>
</div>
</div>
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Calibration configuration</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ul class="org-ul"><li>Insert preamble<br  /><div class="outline-text-5" id="text-4-2-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>Bi207<br  /><div class="outline-text-5" id="text-4-2-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Bi207"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::wdecay0"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Bi-207 decay</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
decay_type       : <span class="org-variable-name">string</span> = <span class="org-string">"background"</span>
decay_isotope    : <span class="org-variable-name">string</span> = <span class="org-string">"Bi207+Pb207m"</span>
</pre>
</div>
</div>
</li>

<li>Co60<br  /><div class="outline-text-5" id="text-4-2-1-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Co60"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::wdecay0"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Co-60 decay</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
decay_type       : <span class="org-variable-name">string</span> = <span class="org-string">"background"</span>
decay_isotope    : <span class="org-variable-name">string</span> = <span class="org-string">"Co60"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Guns configuration</h4>
<div class="outline-text-4" id="text-4-2-2">
</div>
<ul class="org-ul"><li>Insert preamble<br  /><div class="outline-text-5" id="text-4-2-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>1 MeV electron<br  /><div class="outline-text-5" id="text-4-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"electron_1MeV"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::single_particle_generator"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Electron with monokinetic energy @ 1 MeV [miscellaneous]</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Seed for the embedded random number generator:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">seed          : integer = 314159</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generated particle ("electron", "positron", "gamma", "alpha"):</span>
particle_name : <span class="org-variable-name">string</span> = <span class="org-string">"electron"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):</span>
mode          : <span class="org-variable-name">string</span> = <span class="org-string">"monokinetic"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Direction of the emitted particle</span>
emission_direction : <span class="org-variable-name">string</span> = <span class="org-string">"randomized"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The kinetic energy of the generated particle</span>
energy        : real as <span class="org-variable-name">energy</span>  = 1000 keV
</pre>
</div>
</div>
</li>

<li>1 MeV cone electron<br  /><div class="outline-text-5" id="text-4-2-2-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"electron_1MeV_cone"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::single_particle_generator"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Electron with monokinetic energy @ 1 MeV [miscellaneous]</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generated particle ("electron", "positron", "gamma", "alpha"):</span>
particle_name : <span class="org-variable-name">string</span> = <span class="org-string">"electron"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):</span>
mode          : <span class="org-variable-name">string</span> = <span class="org-string">"monokinetic"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Direction of the emitted particle</span>
emission_direction : <span class="org-variable-name">string</span> = <span class="org-string">"cone"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The emission cone axis (values: "+x", "-x", "+y", "-y", "+z", "-z", "30.0 45.0 degree")</span>
cone.axis : <span class="org-variable-name">string</span> = <span class="org-string">"-x"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The default implicit angle unit</span>
angle_unit : <span class="org-variable-name">string</span> = <span class="org-string">"degree"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The minimum emission angle (cone)</span>
cone.min_angle : real as <span class="org-variable-name">angle</span> = 0 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The maximum emission angle (cone)</span>
cone.max_angle : real as <span class="org-variable-name">angle</span> = 10 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The kinetic energy of the generated particle</span>
energy        : real as <span class="org-variable-name">energy</span> = 1000 keV
</pre>
</div>
</div>
</li>
<li>1 MeV cone gamma<br  /><div class="outline-text-5" id="text-4-2-2-4">
