geant4_validation/README.org
**** 1 MeV cone gamma
#+BEGIN_SRC sh
  [name="gamma_1MeV_cone" type="genbb::single_particle_generator"]
  #@config Gamma with monokinetic energy @ 1 MeV [miscellaneous]

  #@description Generated particle ("electron", "positron", "gamma", "alpha"):
  particle_name : string = "gamma"

  #@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):
  mode          : string = "monokinetic"

  #@description Direction of the emitted particle
  emission_direction : string = "cone"

  #@description The emission cone axis (values: "+x", "-x", "+y", "-y", "+z", "-z", "30.0 45.0 degree")
  cone.axis : string = "-x"

  #@description The default implicit angle unit
  angle_unit : string = "degree"

  #@description The minimum emission angle (cone)
  cone.min_angle : real as angle = 0 degree

  #@description The maximum emission angle (cone)
  cone.max_angle : real as angle = 10 degree

  #@description The kinetic energy of the generated particle
  energy        : real as energy = 1000 keV
#+END_SRC

** Vertex configuration
:PROPERTIES:
:TANGLE: config/pipeline/genvertex_manager.conf
:END:
#+BEGIN_SRC sh
  #@config Main configuration parameters for the genvertex manager

  #@description Logging priority
  logging.priority : string = "warning"

  #@description List of files containing particle generator definition rules
  vg_list : string[1] as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/vgs.conf"
#+END_SRC

*** Generators configuration
:PROPERTIES:
:TANGLE: config/pipeline/vgs.conf
:END:
**** Insert preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
**** From the source bulk
#+BEGIN_SRC sh
  [name="source_bulk.vg" type="genvtx::cylinder_model_vg"]

  #@config Vertex generation from the source bulk

  #@description Debug flag
  debug  : boolean = 0

  #@description The rule that describes the geometry origin of vertex in term of geometry category and addresses (geom ID)
  origin : string  = "category='source_film.gc' position={*}"

  #@description The mode used for vertex generator from the underlying box model associated to the target logical volume ("surface" or "bulk")
  mode   : string  = "bulk"
#+END_SRC
**** From the source surface
#+BEGIN_SRC sh
  [name="source_surface.vg" type="genvtx::cylinder_model_vg"]

  #@config Vertex generation from the source surface

  #@description Debug flag
  debug  : boolean = 0

  #@description The rule that describes the geometry origin of vertex in term of geometry category and addresses (geom ID)
  origin : string  = "category='source_film.gc' position={*}"

  #@description The mode used for vertex generator from the underlying box model associated to the target logical volume ("surface" or "bulk")
  mode   : string  = "surface"

  #@description Surface mode cylinder inner face activation
  mode.surface.side   : boolean = 0

  #@description Surface mode cylinder top face activation
  mode.surface.top    : boolean = 1

  #@description Surface mode cylinder bottom face activation
  mode.surface.bottom : boolean = 1
#+END_SRC

** Step hit processor configuration
:PROPERTIES:
:TANGLE: config/pipeline/step_hit_processor_factory.conf
:END:
*** Insert preamble
#+BEGIN_SRC sh
  #@description A list of simulated step hit processors
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
