geant4_validation/README.html
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"gamma_1MeV_cone"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::single_particle_generator"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Gamma with monokinetic energy @ 1 MeV [miscellaneous]</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generated particle ("electron", "positron", "gamma", "alpha"):</span>
particle_name : <span class="org-variable-name">string</span> = <span class="org-string">"gamma"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):</span>
mode          : <span class="org-variable-name">string</span> = <span class="org-string">"monokinetic"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Direction of the emitted particle</span>
emission_direction : <span class="org-variable-name">string</span> = <span class="org-string">"cone"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The emission cone axis (values: "+x", "-x", "+y", "-y", "+z", "-z", "30.0 45.0 degree")</span>
cone.axis : <span class="org-variable-name">string</span> = <span class="org-string">"-x"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The default implicit angle unit</span>
angle_unit : <span class="org-variable-name">string</span> = <span class="org-string">"degree"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The minimum emission angle (cone)</span>
cone.min_angle : real as <span class="org-variable-name">angle</span> = 0 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The maximum emission angle (cone)</span>
cone.max_angle : real as <span class="org-variable-name">angle</span> = 10 degree

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The kinetic energy of the generated particle</span>
energy        : real as <span class="org-variable-name">energy</span> = 1000 keV
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Vertex configuration</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Main configuration parameters for the genvertex manager</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files containing particle generator definition rules</span>
vg_list : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/vgs.conf"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Generators configuration</h4>
<div class="outline-text-4" id="text-4-3-1">
</div>
<ul class="org-ul"><li>Insert preamble<br  /><div class="outline-text-5" id="text-4-3-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>

<li>From the source bulk<br  /><div class="outline-text-5" id="text-4-3-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"source_bulk.vg"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the source bulk</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug  : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The rule that describes the geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span>  = <span class="org-string">"category='source_film.gc' position={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mode used for vertex generator from the underlying box model associated to the target logical volume ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span>  = <span class="org-string">"bulk"</span>
</pre>
</div>
</div>
</li>

<li>From the source surface<br  /><div class="outline-text-5" id="text-4-3-1-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"source_surface.vg"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the source surface</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug  : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The rule that describes the geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span>  = <span class="org-string">"category='source_film.gc' position={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The mode used for vertex generator from the underlying box model associated to the target logical volume ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span>  = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode cylinder inner face activation</span>
mode.surface.side   : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode cylinder top face activation</span>
mode.surface.top    : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode cylinder bottom face activation</span>
mode.surface.bottom : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</li></ul>
</div>
</div>
