geant4_validation/README.org
*** Scintillator/calorimeter hits
#+BEGIN_SRC sh
  [name="scin.hit_processor" type="mctools::calorimeter_step_hit_processor"]

  #@config The step hit processor for the scintillator blocks

  #@description Debug flag
  logging.priority      : string = "warning"

  #@description The name of the category of MC hits output by this processor
  hit.category          : string = "scin.hit"

  #@description The name of the sensitive MC hits the processor must process to fill the output hit category
  sensitive.category    : string = "scin_SD"

  #@description Flag to activate a preallocated buffer/pool of MC hits to optimize memory management
  use_private_pool      : boolean  = 1

  #@description Initial capacity of the buffer/pool of MC hits
  private_pool_capacity : integer  = 10

  #@description The time spread of primary MC step hits to apply the clusterization
  cluster.time_range    : real as time  = 1.0 ns

  #@description The spacial spread of primary MC step hits to apply the clusterization
  cluster.space_range   : real as length = 10.0 mm

  #@description The name of the geometry category to be attached to the output MC hits
  mapping.category      : string = "scin_block.gc"

  #@description The name of the geometry category to be attached to the output MC hits
  ##mapping.category.any_addresses :  string[1] = "part"
#+END_SRC
#+BEGIN_SRC sh
  [name="scin.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting all scintillator hits in the scintillator volume for visualization

  #@description Debug flag
  logging.priority   : string = "warning"

  #@description The name of the target collection of MC hits
  hit.category       : string  = "__visu.tracks"

  #@description The sensitive category
  sensitive.category : string  = "scin_SD"

#+END_SRC
*** Enabling all volumes
#+BEGIN_SRC sh
  [name="all.volumes.visu.hit_processor" type="mctools::push_all_step_hit_processor"]

  #@config The step hit processor for collecting all the visu hits

  #@description Logging flag
  logging.priority     : string  = "warning"

  #@description The category of output hit associated to this processor
  hit.category         : string  = "__visu.tracks"

  #@description The name of the sensitive MC hits that must be processed to fill the output hit category
  sensitive.category   : string  = "__all.volumes.SD"

  #@description Activating all volumes
  geometry.volumes.all : boolean = 1
#+END_SRC

* Pipeline general configuration

SN@ilWare implements the concept of data processing pipeline. An event record
object is passed through a chain of data processing modules, each of them being
responsible for a given task. Modules and services are declared in Section
[[Modules]] and Section [[Services]]. For more details on running SuperNEMO simulations
and the concept behind modules/services see [[http://nile.hep.utexas.edu/cgi-bin/DocDB/ut-nemo/private/ShowDocument?docid=1889][these mandatory presentations]] given
by F. Mauger.

The =@GEANT4_VALIDATION_DIR@= corresponds to the directory where configuration
files are going to be stored. This variable which varies from one installation
to the other, is automatically change when the tangle process occurs. This is
done /via/ the =Makefile= which parse and replace this variable.

** Module manager
:PROPERTIES:
:MKDIRP: yes
:TANGLE: config/pipeline/module_manager.conf
:END:
This file is the main and central piece of code for loading all modules/services
needed by =dpp_processing= binary. It provides links to module files and
service files.
*** Logging priority
#+BEGIN_SRC sh
  #@description Module manager logging priority
  logging.priority : string = "warning"

  #@description Embedded module factory debug flag
  factory.debug : boolean = 0

  #@description Embedded module factory 'no preload' flag
  factory.no_preload : boolean = 0
#+END_SRC

*** Service manager configuration
#+BEGIN_SRC sh
  #@description The configuration file of the embedded service manager
  service_manager.configuration : string[1] as path = \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/service_manager.conf"
#+END_SRC

*** Configuration files for modules
#+BEGIN_SRC sh
  #@description The configuration files for modules
  modules.configuration_files : string[2] as path =                           \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/geant4_simulation_module.conf" \
      "@GEANT4_VALIDATION_DIR@/config/pipeline/geant4_validation_module.conf"
#+END_SRC

** Service manager
:PROPERTIES:
:TANGLE: config/pipeline/service_manager.conf
:END:
*** Logging priority
#+BEGIN_SRC sh
  #@description Service manager logging priority
  logging.priority : string = "warning"
#+END_SRC
