geant4_validation/README.html
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Step hit processor configuration</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Insert preamble</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of simulated step hit processors</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Scintillator/calorimeter hits</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"scin.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::calorimeter_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for the scintillator blocks</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
logging.priority      : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the category of MC hits output by this processor</span>
hit.category          : <span class="org-variable-name">string</span> = <span class="org-string">"scin.hit"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits the processor must process to fill the output hit category</span>
sensitive.category    : <span class="org-variable-name">string</span> = <span class="org-string">"scin_SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate a preallocated buffer/pool of MC hits to optimize memory management</span>
use_private_pool      : <span class="org-variable-name">boolean</span>  = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Initial capacity of the buffer/pool of MC hits</span>
private_pool_capacity : <span class="org-variable-name">integer</span>  = 10

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The time spread of primary MC step hits to apply the clusterization</span>
cluster.time_range    : real as <span class="org-variable-name">time</span>  = 1.0 ns

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The spacial spread of primary MC step hits to apply the clusterization</span>
cluster.space_range   : real as <span class="org-variable-name">length</span> = 10.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry category to be attached to the output MC hits</span>
mapping.category      : <span class="org-variable-name">string</span> = <span class="org-string">"scin_block.gc"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry category to be attached to the output MC hits</span>
<span class="org-comment-delimiter">##</span><span class="org-comment">mapping.category.any_addresses :  string[1] = "part"</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"scin.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting all scintillator hits in the scintillator volume for visualization</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
logging.priority   : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the target collection of MC hits</span>
hit.category       : <span class="org-variable-name">string</span>  = <span class="org-string">"__visu.tracks"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The sensitive category</span>
sensitive.category : <span class="org-variable-name">string</span>  = <span class="org-string">"scin_SD"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> Enabling all volumes</h4>
<div class="outline-text-4" id="text-4-4-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"all.volumes.visu.hit_processor"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::push_all_step_hit_processor"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config The step hit processor for collecting all the visu hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag</span>
logging.priority     : <span class="org-variable-name">string</span>  = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The category of output hit associated to this processor</span>
hit.category         : <span class="org-variable-name">string</span>  = <span class="org-string">"__visu.tracks"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the sensitive MC hits that must be processed to fill the output hit category</span>
sensitive.category   : <span class="org-variable-name">string</span>  = <span class="org-string">"__all.volumes.SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Activating all volumes</span>
geometry.volumes.all : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Pipeline general configuration</h2>
<div class="outline-text-2" id="text-5">
<p>
SN@ilWare implements the concept of data processing pipeline. An event record
object is passed through a chain of data processing modules, each of them being
responsible for a given task. Modules and services are declared in Section
<i>Modules</i> and Section <a href="#sec-7">7</a>. For more details on running SuperNEMO simulations
and the concept behind modules/services see <a href="http://nile.hep.utexas.edu/cgi-bin/DocDB/ut-nemo/private/ShowDocument?docid=1889">these mandatory presentations</a> given
by F. Mauger.
</p>

<p>
The <code>@GEANT4_VALIDATION_DIR@</code> corresponds to the directory where configuration
files are going to be stored. This variable which varies from one installation
to the other, is automatically change when the tangle process occurs. This is
done <i>via</i> the <code>Makefile</code> which parse and replace this variable.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Module manager</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This file is the main and central piece of code for loading all modules/services
needed by <code>dpp_processing</code> binary. It provides links to module files and
service files.
</p>
</div>
<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Module manager logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded module factory debug flag</span>
factory.debug : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded module factory 'no preload' flag</span>
factory.no_preload : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Service manager configuration</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The configuration file of the embedded service manager</span>
service_manager.configuration : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/service_manager.conf"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Configuration files for modules</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The configuration files for modules</span>
modules.configuration_files : string[2] as <span class="org-variable-name">path</span> =                           <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/geant4_simulation_module.conf"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/geant4_validation_module.conf"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Service manager</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Service manager logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
