geant4_validation/README.html

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Name &amp; description</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the service manager</span>
name : <span class="org-variable-name">string</span> = <span class="org-string">"sn_service_manager"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The description of the service manager</span>
description : <span class="org-variable-name">string</span> = <span class="org-string">"A SuperNEMO service manager"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> List of service files</h4>
<div class="outline-text-4" id="text-5-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of files that describe services</span>
services.configuration_files : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/services.conf"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> DLL loader</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> Code generator</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
This skeleton code ease the declaration of dll loader since it
receives a table list and builds the corresponding <code>dlls.conf</code> file.
</p>

<div class="org-src-container">

<pre class="src src-sh" id="dll_loader"><span class="org-builtin">echo</span> <span class="org-string">'#@description A sample list of setups'</span>
<span class="org-builtin">echo</span> <span class="org-string">'#@key_label   "name"'</span>
<span class="org-builtin">echo</span> <span class="org-string">'#@meta_label  "filename"'</span>
<span class="org-variable-name">arr_name</span>=(${<span class="org-variable-name">name</span>})
<span class="org-variable-name">arr_filename</span>=($<span class="org-variable-name">filename</span>)
<span class="org-keyword">for</span> ((<span class="org-variable-name">i</span>=0; i &lt; ${#<span class="org-variable-name">arr_name</span>[@]}; i++))
<span class="org-keyword">do</span>
    <span class="org-variable-name">dll</span>=${<span class="org-variable-name">arr_name</span>[$<span class="org-variable-name">i</span>]}
    <span class="org-variable-name">dllpath</span>=${<span class="org-variable-name">arr_filename</span>[$<span class="org-variable-name">i</span>]}
    <span class="org-keyword">if</span> [ <span class="org-string">"$dllpath"</span> != <span class="org-string">"none"</span> ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">'[name="'</span>$<span class="org-variable-name">dll</span><span class="org-string">'" filename="'</span>$<span class="org-variable-name">dllpath</span><span class="org-string">'"]'</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">echo</span> <span class="org-string">'[name="'</span>$<span class="org-variable-name">dll</span><span class="org-string">'" filename=""]'</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">echo</span> <span class="org-string">'#config The '</span>$<span class="org-variable-name">dll</span><span class="org-string">' library'</span>
    <span class="org-builtin">echo</span> <span class="org-string">'autoload : boolean = 1'</span>
    <span class="org-builtin">echo</span>
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> Libraries</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
This part set the different libraries to be loaded at runtime. This is needed
since event data models are defined in other libraries than the one currently
named <code>geant4_validation</code>. The following table sets the libraries
</p>

<table id="dll_libraries-:results-none" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="void">
<caption class="t-above"><span class="table-number">Table 1:</span> Libraries to be used by <code>geant4_validation</code> modules</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Bayeux_mctools_geant4</td>
<td class="left">$SNAILWARE_PRO_DIR/bayeux/install/lib64/libBayeux_mctools_geant4.so</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "filename"</span>
[<span class="org-variable-name">name</span>=<span class="org-string">"Bayeux_mctools_geant4"</span> <span class="org-variable-name">filename</span>=<span class="org-string">"$SNAILWARE_PRO_DIR/bayeux/install/lib64/libBayeux_mctools_geant4.so"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">config The Bayeux_mctools_geant4 library</span>
<span class="org-builtin">autoload</span> : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Modules configuration</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Simulation module</h3>
<div class="outline-text-3" id="text-6-1">
</div>

<div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> Module preamble</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> Declaration &amp; description</h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"geant4_simulation_module"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mctools::g4::simulation_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description A threaded Geant4 simulation module</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> Logging priority</h4>
<div class="outline-text-4" id="text-6-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> Bank &amp; service labels</h4>
<div class="outline-text-4" id="text-6-1-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The Geometry Service label</span>
Geo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Geo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The 'Simulated data' bank label in the event record</span>
SD_label  : <span class="org-variable-name">string</span> = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to allow cleaning of some former simulated data bank if any (default: 0)</span>
erase_former_SD_bank : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> Seed values</h4>
<div class="outline-text-4" id="text-6-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The simulation manager PRNG seed</span>
manager.seed                  : <span class="org-variable-name">integer</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The vertex generator PRNG seed</span>
manager.vertex_generator_seed : <span class="org-variable-name">integer</span> = 4

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The event generator PRNG seed</span>
manager.event_generator_seed  : <span class="org-variable-name">integer</span> = 5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The SHPF PRNG seed</span>
manager.shpf_seed             : <span class="org-variable-name">integer</span> = 6

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The saving of PRNG seeds</span>
manager.output_prng_seeds_file  : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/prng_seeds.save"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The saving of PRNG states</span>
manager.output_prng_states_file : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/prng_states.save"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The modulo for PRNG states backup</span>
manager.prng_states_save_modulo : <span class="org-variable-name">integer</span> = 10
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> Vertex generator</h4>
<div class="outline-text-4" id="text-6-1-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The vertex generator PRNG label</span>
manager.vertex_generator_name : <span class="org-variable-name">string</span>  = <span class="org-string">"source_bulk.vg"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-1-7" class="outline-4">
<h4 id="sec-6-1-7"><span class="section-number-4">6.1.7</span> Event generator</h4>
<div class="outline-text-4" id="text-6-1-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The event generator PRNG label</span>
manager.event_generator_name  : <span class="org-variable-name">string</span>  = <span class="org-string">"Bi207"</span>
</pre>
</div>
</div>
</div>
