geant4_validation/README.html

<div id="outline-container-sec-6-1-8" class="outline-4">
<h4 id="sec-6-1-8"><span class="section-number-4">6.1.8</span> Simulation manager</h4>
<div class="outline-text-4" id="text-6-1-8">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The simulation manager configuration file</span>
manager.configuration_filename : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/g4_manager.conf"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Validation module</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The next item holds the configuration for validating Geant4 setup. The second
item is related to histogram declarations.
</p>

<p>
Here, we just set up the module declaration.
</p>
</div>

<div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Module preamble</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Declaration &amp; description</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"geant4_validation_module"</span> <span class="org-variable-name">type</span>=<span class="org-string">"analysis::geant4_validation_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description A module to study and to validate Geant4 setup</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> Logging priority</h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"notice"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> Histogram service label</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
Set the same histogram service label as defined <a href="#sec-7-4">here</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>
</pre>
</div>
</div>

<ul class="org-ul"><li>Histogram declarations<br  /><div class="outline-text-5" id="text-6-2-4-1">
<p>
The histogram declarations <i>i.e.</i> name, boundaries, binning&#x2026; are set in this
section which is organized by data bank related plots. There are two kinds of
histograms:
</p>
<ul class="org-ul">
<li><i>template</i> histogram which may be used by several data bank.
</li>
</ul>
</div>

<ul class="org-ul"><li>Mandatory preamble<br  /><div class="outline-text-6" id="text-6-2-4-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</li>
<li>Energy template<br  /><div class="outline-text-6" id="text-6-2-4-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"energy_template"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">""</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"__template"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"\Upsigma_\text{\tiny 1,2}$E$_\text{calibrated}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.xaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"dN/dE [A.U.]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The unit of the bins' bounds (a standard unit, typically SI or CLHEP)</span>
unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = 2000.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 3200.0
</pre>
</div>
</div>
</li></ul>
</li></ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Services</h2>
<div class="outline-text-2" id="text-7">
<p>
A service generally hosts a specific resource that can be shared by many other
software components, including other services or data processing modules (see
<a href="https://nemo.lpc-caen.in2p3.fr/wiki/SNSW_SNailWare_FAQ#Whatisaservice">SN@ilWare FAQ</a>).
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Preamble</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Context service</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Ctx"</span> <span class="org-variable-name">type</span>=<span class="org-string">"dpp::context_service"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description File from which the context is to be loaded at program start</span>
load.file : string as <span class="org-variable-name">path</span>  = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description File to store the context at program termination</span>
store.file : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context_end.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to backup the former context load file</span>
backup.file : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context_bak.conf"</span>
</pre>
</div>
</div>
</div>
