geant4_validation/README.html
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Geometry service</h3>
<div class="outline-text-3" id="text-7-3">
<p>
The following code block declares the geometry service to properly load all the
geometry and material construction of the detector. This service, only declared
here, can be used by several operations like calibration, particle track
reconstruction &#x2026; but all of them will use the same geometry.
</p>

<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Geo"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::geometry_service"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded SuperNEMO geometry manager main configuration file</span>
manager.configuration_file : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/geometry/manager.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded SuperNEMO geometry manager must build its mapping lookup table</span>
manager.build_mapping : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded geometry manager's mapping lookup table does not exclude any geometry category</span>
manager.no_excluded_categories : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Histogram service</h3>
<div class="outline-text-3" id="text-7-4">
<p>
The histogram service provides an esay way to handle histogram plot from
different modules (mainly plot modules). It provides a service where 1D or 2D
histograms can be added to a histogram dictionnary.
</p>

<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Histo"</span> <span class="org-variable-name">type</span>=<span class="org-string">"dpp::histogram_service"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The description string of the embedded pool of histograms</span>
pool.description : <span class="org-variable-name">string</span> = <span class="org-string">"Geant4 histograms"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The main configuration file for the embedded histogram manager</span>
pool.histo.setups : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@GEANT4_VALIDATION_DIR@/config/pipeline/histogram_templates.conf"</span>
</pre>
</div>

<p>
Finally, all histograms created can be stored inside ROOT files or XML archives.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The ouput file where to store the histograms</span>
output_files : string[2] as <span class="org-variable-name">path</span> =                        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"/tmp/${USER}/snemo.d/geant4_validation_histos.root"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"/tmp/${USER}/snemo.d/geant4_vlaidation_histos.xml"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Running SN@ilWare processing chain</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Tangling configuration</h3>
<div class="outline-text-3" id="text-8-1">
<p>
First, you need to tangle this file. As explained in the <a href="#sec-2">Content</a> section, you
may use the dedicated <code>Makefile</code> to generate the pipeline configuration. Just
run <code>make</code> within this working directory.
</p>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Source code compilation</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Second, you need to compile the <code>geant4_validation</code> module files. The build
system used is <code>cmake</code> and a <code>CMakeLists.txt</code> file is provided to correctly
setup the dependences. Nevertheless, this implies that you have already and
correctly installed <a href="https://nemo.lpc-caen.in2p3.fr/wiki/Software/Cadfael">Cadfael</a>, <a href="https://nemo.lpc-caen.in2p3.fr/wiki/Software/Bayeux">Bayeux</a> and Falaise. Then, you can configure, build
and install the <code>geant4_validation</code> module by doing
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir {build,install} &amp;&amp; <span class="org-builtin">cd</span> build
cmake                                               <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_PREFIX_PATH=<span class="org-string">"&lt;path to Falaise install&gt;"</span> <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_INSTALL_PREFIX=../install               <span class="org-sh-escaped-newline">\</span>
    ../source
make install
<span class="org-builtin">cd</span> ..
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Use and execute <code>geant4_validation</code> module</h3>
<div class="outline-text-3" id="text-8-3">
<p>
After a successful build, you will get an <code>install</code> directory holding the
<code>libgeant4_validation.so</code> file. Assuming you are under <code>bash</code> shell, you will
need to add it to your <code>LD_LIBRARY_PATH</code> by doing
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">LD_LIBRARY_PATH</span>=${<span class="org-variable-name">PWD</span>}/install/lib:${<span class="org-variable-name">LD_LIBRARY_PATH</span>}
</pre>
</div>

<p>
Another approach, maybe less intrusive, will be to set the <code>LD_LIBRARY_PATH</code>
when running the <code>dpp_processing</code> binary. You can for example write something
like
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-variable-name">LD_LIBRARY_PATH</span>=${<span class="org-variable-name">PWD</span>}/install/lib:${<span class="org-variable-name">LD_LIBRARY_PATH</span>} dpp_processing ...
</pre>
</div>

<p>
Running processing pipeline is done by the <code>dpp_processing</code> program provided by
<code>dpp</code> library. Its call is pretty simple and only implies to have a module
manager file and the name of the module to be run <i>i.e.</i>
<code>geant4_validation_module</code>. Nevertheless, you need to dynamically load the
library(ies) which holds the needed modules.
</p>

<div class="org-src-container">

<pre class="src src-sh">dpp_processing                                                       <span class="org-sh-escaped-newline">\</span>
    --module-manager-config $<span class="org-variable-name">PWD</span>/config/pipeline/module_manager.conf <span class="org-sh-escaped-newline">\</span>
    --module geant4_validation_module                                <span class="org-sh-escaped-newline">\</span>
    --load-dll geant4_validation                                     <span class="org-sh-escaped-newline">\</span>
    --load-dll &lt;library&gt;_bio
</pre>
</div>

<p>
<code>&lt;library&gt;_bio</code> represents libraries which holds event data models such as
<code>mctools_bio</code>. You can use the <code>dlls.conf</code> file built in section <a href="#sec-5-3">5.3</a> by
writing
</p>

<div class="org-src-container">

<pre class="src src-sh">dpp_processing                                                       <span class="org-sh-escaped-newline">\</span>
    --module-manager-config $<span class="org-variable-name">PWD</span>/config/pipeline/module_manager.conf <span class="org-sh-escaped-newline">\</span>
    --module geant4_validation_module                                <span class="org-sh-escaped-newline">\</span>
    --load-dll geant4_validation                                     <span class="org-sh-escaped-newline">\</span>
    --dll-config $<span class="org-variable-name">PWD</span>/config/pipeline/dlls.conf
</pre>
</div>

<p>
It will run the <code>geant4_validation_module</code> and it will generate a ROOT file
containing several histograms. This file is located by default, in
<code>/tmp/${USER}/snemo.d</code> directory under the <code>geant4_validation_histos.root</code>
name. You can change the output directory and output file name in <a href="#sec-7-4">this section</a>.
</p>
</div>
</div>
</div>
